{
  "Con Law": [
    {
      "qid": "fresh_openai_1755099865551_bafecf05",
      "subject": "Con Law",
      "topic": "General",
      "stem": "A state legislature passes a law that prohibits the sale of any product that is not manufactured within the state, arguing it is necessary to protect local businesses. A national retailer challenges the law, claiming it violates the Commerce Clause of the Constitution. Which of the following statements is most accurate regarding the constitutionality of the state law?",
      "choices": [
        "The law is constitutional if it serves a legitimate local purpose and does not impose an undue burden on interstate commerce.",
        "The law is unconstitutional because all states must allow the sale of any product manufactured elsewhere.",
        "The law is constitutional because states have the right to regulate commerce within their borders.",
        "The law is unconstitutional because it discriminates against interstate commerce."
      ],
      "correctIndex": 3,
      "explanation": "The law is unconstitutional because it discriminates against interstate commerce, violating the dormant Commerce Clause.",
      "explanationLong": "The correct answer is that the law is unconstitutional because it discriminates against interstate commerce. The dormant Commerce Clause prohibits states from enacting laws that favor in-state economic interests over those from out of state. In this case, the law restricts the sale of products not manufactured within the state, which discriminates against out-of-state manufacturers and impedes interstate commerce. Answer choice one is incorrect because while states can regulate commerce, they cannot do so in a manner that discriminates against interstate commerce. Answer choice three is incorrect; while a state law can be constitutional if it serves a legitimate local purpose, this law's discriminatory nature makes it unconstitutional regardless of purpose. Answer choice four is incorrect because it misstates the law; states do not have to allow the sale of all products from other states, but they cannot favor their own products over those from other states in a discriminatory manner.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099925551,
      "generatedAt": 1755099865552
    },
    {
      "qid": "fresh_openai_1755099868755_96092a30",
      "subject": "Con Law",
      "topic": "General",
      "stem": "A state legislature passes a law requiring all public schools to include a moment of silence at the beginning of each school day. The law does not specify the purpose of the moment of silence, but school officials encourage students to use the time for prayer. A group of parents challenges the law, claiming it violates the Establishment Clause of the First Amendment. What is the likely outcome of this challenge?",
      "choices": [
        "The law is likely constitutional because it allows for personal reflection without mandating prayer.",
        "The law is likely unconstitutional as it promotes a religious activity in public schools.",
        "The law is likely unconstitutional because it lacks a secular purpose.",
        "The law is likely constitutional as it does not coerce students to pray."
      ],
      "correctIndex": 1,
      "explanation": "The law is likely unconstitutional as it promotes a religious activity in public schools.",
      "explanationLong": "The correct answer is that the law is likely unconstitutional as it promotes a religious activity in public schools. The Establishment Clause prohibits laws that advance or inhibit religion, and while a moment of silence may seem neutral, the encouragement for prayer suggests a religious purpose, violating the Lemon test established in Lemon v. Kurtzman. Answer choice B is incorrect because the encouragement of prayer undermines the claim of neutrality and does not fulfill the secular purpose requirement. Answer choice C is incorrect; while a lack of secular purpose is a valid concern, the promotion of prayer alone suffices to establish unconstitutionality under the Establishment Clause. Answer choice D is also incorrect because the presence of coercion is not required for a violation; the mere endorsement of prayer in a public school context is sufficient to violate the Establishment Clause, regardless of whether students are coerced to pray.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099928755,
      "generatedAt": 1755099868755
    },
    {
      "qid": "fresh_openai_1755099868075_3a6b392b",
      "subject": "Con Law",
      "topic": "General",
      "stem": "A state passes a law that prohibits the sale of any books that contain explicit sexual content, arguing that it is necessary to protect community morals. A local bookstore owner challenges the law, claiming it violates the First Amendment. Which of the following is the most likely outcome of the challenge?",
      "choices": [
        "The law is struck down because it imposes an unconstitutional prior restraint on free speech.",
        "The law is struck down because it discriminates against certain viewpoints.",
        "The law is upheld because states have the right to regulate materials in the interest of community standards.",
        "The law is upheld because it serves a compelling state interest in protecting minors."
      ],
      "correctIndex": 0,
      "explanation": "The law is struck down because it imposes an unconstitutional prior restraint on free speech.",
      "explanationLong": "The correct answer is that the law is struck down because it imposes an unconstitutional prior restraint on free speech. Under the First Amendment, laws that censor speech based on content are subject to strict scrutiny, requiring the government to demonstrate that they serve a compelling interest and are narrowly tailored to achieve that interest. In this case, while the state may argue it has a legitimate interest in regulating community morals, the blanket prohibition on explicit sexual content is overly broad and not the least restrictive means to achieve that interest. The first option is incorrect because it misapplies the balancing of interests; while states do have some power to regulate, they cannot do so in a way that infringes on protected speech. The third option is incorrect because protecting minors does not justify a blanket ban on all explicit content; more targeted measures are required. Finally, the fourth option is incorrect as the law does not explicitly discriminate against viewpoints but rather restricts a category of content, which is a different legal issue.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099928075,
      "generatedAt": 1755099868076
    },
    {
      "qid": "fresh_openai_1755100168692_e9a1fb00",
      "subject": "Con Law",
      "topic": "General",
      "stem": "A city council passed an ordinance that prohibits any outdoor public assembly without a permit. The ordinance requires applicants to provide a detailed description of the event, including the expected number of participants and the purpose of the assembly. A local activist group challenges the ordinance, arguing it violates their First Amendment rights. Which of the following is the most likely outcome of the challenge?",
      "choices": [
        "The ordinance is unconstitutional because it constitutes a prior restraint on free speech.",
        "The ordinance is constitutional as it serves a compelling government interest.",
        "The ordinance is constitutional because it is a reasonable time, place, and manner restriction.",
        "The ordinance is unconstitutional because it discriminates against political speech."
      ],
      "correctIndex": 2,
      "explanation": "The correct answer is that the ordinance is constitutional because it is a reasonable time, place, and manner restriction.",
      "explanationLong": "The correct answer is that the ordinance is constitutional because it is a reasonable time, place, and manner restriction. The Supreme Court has established that government can impose regulations on public assembly as long as they are content-neutral, narrowly tailored to serve a significant government interest, and leave open ample alternative channels for communication. In this case, the ordinance applies to all public assemblies without regard to content and serves the significant interests of public safety and order. Answer A is incorrect because while prior restraints are generally disfavored, this ordinance does not prohibit speech outright; it merely regulates the manner of assembly. Answer C is wrong because the ordinance applies equally to all types of assemblies, not just political speech, thus it does not discriminate. Finally, answer D is misleading; while the ordinance serves a government interest, it is the reasonableness of the restriction that determines its constitutionality, not the compelling interest standard which applies to content-based restrictions.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100228692,
      "generatedAt": 1755100168692
    },
    {
      "qid": "fresh_openai_1755100167849_f9f87976",
      "subject": "Con Law",
      "topic": "General",
      "stem": "A state passes a law requiring all citizens to present a government-issued photo ID before voting. The law is challenged in court on the grounds that it violates the Voting Rights Act. What is the most likely outcome of this challenge?",
      "choices": [
        "The law is constitutional as long as the state provides free photo IDs to all citizens.",
        "The law is unconstitutional because it discriminates against minority voters.",
        "The law is constitutional because states have the authority to regulate their own voting procedures.",
        "The law is unconstitutional because it imposes an undue burden on the right to vote."
      ],
      "correctIndex": 2,
      "explanation": "The correct answer is that the law is constitutional because states have the authority to regulate their own voting procedures, as long as they do not violate federal law.",
      "explanationLong": "The correct answer is that the law is constitutional because states have the authority to regulate their own voting procedures. Under the U.S. Constitution, states have the power to determine the manner in which elections are conducted, including voter identification requirements, as long as these do not infringe on the Voting Rights Act. In this case, while the law may impose some burden, it does not inherently discriminate against any group unless proven otherwise. The first answer is incorrect because while undue burdens are a consideration, the law does not impose such a burden if it allows for reasonable access to IDs. The third answer is incorrect because merely requiring ID does not, in itself, constitute discrimination unless it is shown to disproportionately affect a protected class. The fourth answer is misleading; while providing free IDs may mitigate concerns, the law's constitutionality does not solely depend on this provision but rather on the state's authority to regulate voting procedures.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100227849,
      "generatedAt": 1755100167849
    },
    {
      "qid": "fresh_openai_1755100169367_019a96a2",
      "subject": "Con Law",
      "topic": "General",
      "stem": "A state legislature passes a law that requires all businesses to close by 8 PM to reduce noise in residential areas. A local bar challenges the law, arguing that it violates their right to due process under the Fourteenth Amendment. What is the most likely outcome of the challenge?",
      "choices": [
        "The law is unconstitutional because it discriminates against businesses operating in residential areas.",
        "The law is constitutional under the police power of the state to regulate businesses for the public welfare.",
        "The law is unconstitutional because it infringes on the First Amendment right to freedom of speech.",
        "The law is unconstitutional because it violates the bar's right to due process as a property interest."
      ],
      "correctIndex": 1,
      "explanation": "The law is constitutional under the police power of the state to regulate businesses for the public welfare.",
      "explanationLong": "The correct answer is that the law is constitutional under the police power of the state to regulate businesses for the public welfare. States have broad authority to enact laws that promote the health, safety, and general welfare of their citizens, and regulating business hours to mitigate noise is a valid exercise of this power. The bar's challenge based on due process is unlikely to succeed because the law does not deprive the bar of any fundamental rights or property without due process; it merely imposes a reasonable regulation. The first incorrect answer misapplies due process by failing to recognize that economic regulations are typically upheld unless they are arbitrary or irrational. The third answer incorrectly asserts a First Amendment violation; the law does not target speech but rather regulates business hours. Lastly, the fourth answer incorrectly claims discrimination against businesses; the law applies uniformly to all businesses in the state, thus not violating equal protection principles.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100229368,
      "generatedAt": 1755100169368
    },
    {
      "qid": "fresh_openai_1755100334537_30c726c9",
      "subject": "Con Law",
      "topic": "General",
      "stem": "The city of Springfield has enacted an ordinance that prohibits all forms of public speech in its parks, citing a need to maintain public order and safety. A group of local activists wishes to hold a peaceful demonstration in one of the parks to promote environmental awareness. They challenge the ordinance in court. What is the likely outcome of their challenge?",
      "choices": [
        "The ordinance is constitutional because it applies equally to all speech, regardless of content.",
        "The ordinance is constitutional because the city has a legitimate interest in maintaining public order.",
        "The ordinance is unconstitutional as it broadly prohibits speech in a public forum without sufficient justification.",
        "The ordinance is unconstitutional because it does not provide for a permit system for public demonstrations."
      ],
      "correctIndex": 2,
      "explanation": "The ordinance is unconstitutional as it broadly prohibits speech in a public forum without sufficient justification.",
      "explanationLong": "The correct answer is that the ordinance is unconstitutional as it broadly prohibits speech in a public forum without sufficient justification. Under the First Amendment, public parks are considered traditional public forums where free speech is highly protected. The city must demonstrate a compelling interest and that the restrictions are narrowly tailored to serve that interest, which it has not done in this case. Answer choice 1 is correct because the blanket prohibition lacks the required justification. Answer choice 2 is incorrect because while maintaining order is a legitimate interest, it does not justify an outright ban on speech. Answer choice 3 is incorrect as well; even if the ordinance applies equally to all speech, it still must meet the strict scrutiny standard in public forums, which it fails to do. Finally, answer choice 4 is misleading; while a permit system could be a reasonable regulation, it does not address the fundamental issue that the ordinance itself is an unconstitutional prior restraint on free speech.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100394537,
      "generatedAt": 1755100334537
    },
    {
      "qid": "fresh_openai_1755100322887_99838ed8",
      "subject": "Con Law",
      "topic": "General",
      "stem": "A state legislature enacts a law that requires all public school students to recite a specific patriotic pledge at the beginning of each school day. The law does not allow any exemptions for students who, for religious or personal reasons, choose not to participate. A group of parents files a lawsuit against the state, arguing that the law violates the Establishment Clause of the First Amendment. What is the likely outcome of the lawsuit?",
      "choices": [
        "The law is unconstitutional because it violates the Free Exercise Clause.",
        "The law is unconstitutional because it coerces students to engage in a religious exercise.",
        "The law is constitutional because it does not favor one religion over another.",
        "The law is constitutional because it promotes patriotism among students."
      ],
      "correctIndex": 1,
      "explanation": "The law is unconstitutional because it coerces students to engage in a religious exercise.",
      "explanationLong": "The correct answer is that the law is unconstitutional because it coerces students to engage in a religious exercise. Under the Establishment Clause of the First Amendment, the government cannot compel individuals to participate in religious activities, and this law mandates participation in a pledge that has been viewed as a form of religious expression. The coercion of students without allowing exemptions for personal or religious beliefs violates principles established in cases such as *Engel v. Vitale*, where the Supreme Court ruled against mandated prayer in schools. The second answer is incorrect because promoting patriotism does not justify the infringement on individual rights, especially when it comes to religious freedoms. The third answer fails because the law's coercive nature is not mitigated by the absence of favoritism toward a specific religion; the issue lies in the compulsion itself. Lastly, the fourth answer is incorrect as it misapplies the Free Exercise Clause; the primary issue here is coercion rather than free exercise, although both clauses are relevant to the overall analysis.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100382887,
      "generatedAt": 1755100322888
    },
    {
      "qid": "fresh_openai_1755100326877_71c9012f",
      "subject": "Con Law",
      "topic": "General",
      "stem": "During a heated election season, a state legislature passes a law that prohibits any political advertisements from being broadcast within 60 days of an election. The law is intended to reduce misinformation and promote fair campaigning. A political action committee (PAC) challenges the law, arguing that it violates the First Amendment's protection of free speech. Which of the following is most likely to be the outcome of this challenge?",
      "choices": [
        "The law is unconstitutional because it does not provide any exceptions for factually accurate advertisements.",
        "The law is unconstitutional because it restricts political speech during a critical time for public discourse.",
        "The law is constitutional because the state has a compelling interest in preventing misinformation.",
        "The law is constitutional because it applies equally to all political advertisements."
      ],
      "correctIndex": 1,
      "explanation": "The law is unconstitutional because it restricts political speech during a critical time for public discourse, violating the First Amendment.",
      "explanationLong": "The correct answer is that the law is unconstitutional because it restricts political speech during a critical time for public discourse. Under the First Amendment, political speech is afforded the highest level of protection, particularly during elections when voters need access to diverse viewpoints. The law's broad prohibition on advertising within 60 days of an election is likely to be viewed as a substantial burden on free speech rights, lacking a compelling justification that would withstand strict scrutiny. The second choice is incorrect because, although states can regulate speech, they must show that their interests are compelling and that the law is narrowly tailored, which this law fails to do. The third option misapplies the equal treatment principle; even if the law applies equally, it still must not infringe on free speech rights. Lastly, the fourth choice is incorrect because the unconstitutionality of the law does not hinge solely on the absence of exceptions for accurate advertisements; rather, the law's timing and scope itself represents a broad infringement of First Amendment rights.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100386877,
      "generatedAt": 1755100326877
    }
  ],
  "Property": [
    {
      "qid": "fresh_openai_1755099869478_567324bb",
      "subject": "Property",
      "topic": "RAP",
      "stem": "Alice conveys a parcel of land to Bob for life, then to the children of Bob who reach the age of 25. Bob has two children, Charlie and Dana, who are both currently 20 years old. Under the terms of the conveyance, what is the status of the future interest held by Bob's children with respect to the Rule Against Perpetuities?",
      "choices": [
        "The future interest is invalid because it may not vest within 21 years after Bob's death.",
        "The future interest is valid because it will vest when either child turns 25.",
        "The future interest is valid because Bob's children are identifiable and the age condition is certain.",
        "The future interest is invalid because it is contingent upon both children reaching the age of 25."
      ],
      "correctIndex": 0,
      "explanation": "The correct answer is that the future interest is invalid because it may not vest within 21 years after Bob's death, violating the Rule Against Perpetuities.",
      "explanationLong": "The correct answer is that the future interest is invalid because it may not vest within 21 years after Bob's death. Under the Rule Against Perpetuities (RAP), a future interest must vest, if at all, within 21 years after the death of a relevant life in being. Here, Bob's children, Charlie and Dana, must reach the age of 25 for the interest to vest. Since they are currently 20, it is possible that either could die before reaching 25, and thus the interest could remain contingent and unvested beyond the permissible period. Answer choice 1 is incorrect because while the interest may vest at 25, it does not guarantee vesting within the RAP timeframe. Answer choice 3 is incorrect because, although the children are identifiable, the condition of reaching 25 years of age creates a risk that the interest may remain contingent beyond the RAP period. Finally, answer choice 4 is incorrect because the invalidity arises from the vesting uncertainty regarding the time frame rather than solely on the number of children reaching the age condition.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099929478,
      "generatedAt": 1755099869478
    },
    {
      "qid": "fresh_openai_1755099867919_3024a4cd",
      "subject": "Property",
      "topic": "Future Interests",
      "stem": "Alice conveys her 100-acre farm to Bob 'for as long as the land is used for farming purposes, but if it is ever used for any other purpose, to Carol.' What type of future interest does Carol have in the property?",
      "choices": [
        "A possibility of reverter.",
        "A remainder in fee simple subject to a condition subsequent.",
        "A contingent remainder.",
        "A vested remainder."
      ],
      "correctIndex": 0,
      "explanation": "Carol has a possibility of reverter because the conveyance to Bob is a fee simple determinable, which automatically reverts to Carol if the condition is violated.",
      "explanationLong": "The correct answer is that Carol has a possibility of reverter. In this case, Alice conveyed the property to Bob 'for as long as the land is used for farming purposes,' creating a fee simple determinable. This means that the property automatically reverts to Alice (or her successors) if the condition is not met. Carol's interest is a possibility of reverter because it is contingent upon Bob ceasing to use the land for farming, at which point Carol will take possession. The first wrong answer, a remainder in fee simple subject to a condition subsequent, is incorrect because a remainder cannot follow a fee simple determinable; it must follow a fee simple subject to a condition subsequent. The second wrong answer, a contingent remainder, is incorrect because a contingent remainder requires a third party's interest and is not applicable here. The fourth wrong answer, a vested remainder, is incorrect because Carol does not have a vested interest; she only has a contingent right to the property should the condition precedent not be satisfied.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099927919,
      "generatedAt": 1755099867920
    },
    {
      "qid": "fresh_openai_1755099867051_8c115e88",
      "subject": "Property",
      "topic": "Estates",
      "stem": "Alice owns a parcel of land and conveys it to Bob 'for life, then to Carol.' After Bob's death, he bequeaths his life estate to his friend Dave. What is the status of the land after Bob's death?",
      "choices": [
        "Dave retains the life estate and can possess the land for the remainder of his life.",
        "The land reverts back to Alice's estate upon Bob's death.",
        "Carol becomes the owner of the land immediately upon Bob's death.",
        "Bob's will is invalid, and the land passes directly to Carol."
      ],
      "correctIndex": 2,
      "explanation": "Carol becomes the owner of the land immediately upon Bob's death, as a life estate cannot be devised.",
      "explanationLong": "The correct answer is that Carol becomes the owner of the land immediately upon Bob's death. In this scenario, Bob holds a life estate, which is a non-inheritable interest. Upon Bob's death, the property automatically passes to the remainderman, Carol, as specified in the conveyance. The attempted bequest of the life estate to Dave is ineffective because a life estate cannot be transferred or devised. Option B is incorrect because Dave cannot retain the life estate; it terminates at Bob's death, and he has no interest in the property. Option C is incorrect because the land does not revert to Alice; it passes directly to Carol as the remainder. Option D is incorrect as well because Bob's will does not affect the conveyance; he cannot devise a life estate that he does not own posthumously. Thus, the correct outcome is that Carol takes immediate ownership upon Bob's death.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099927051,
      "generatedAt": 1755099867051
    },
    {
      "qid": "fresh_openai_1755100174592_b572d0ed",
      "subject": "Property",
      "topic": "Easements",
      "stem": "Alice owns a parcel of land adjacent to Bob’s property. Bob has been using a path that crosses Alice’s land to access a public road for over 10 years. Alice has never objected to Bob’s use of the path. Recently, Alice decided to put up a fence blocking Bob's access. Bob claims he has a right to continue using the path. What is the most likely outcome if Bob asserts his claim?",
      "choices": [
        "Bob does not have an easement because Alice never granted permission for his use of the path.",
        "Bob has an easement by necessity because he needs access to the public road.",
        "Bob has an easement by prescription because he used the path openly and continuously for more than 10 years.",
        "Bob has a license to use the path, which can be revoked by Alice at any time."
      ],
      "correctIndex": 2,
      "explanation": "Bob has an easement by prescription due to his continuous and open use of the path for over 10 years.",
      "explanationLong": "The correct answer is that Bob has an easement by prescription because he has used the path openly, continuously, and without objection from Alice for more than the statutory period of 10 years. Under the law, an easement by prescription arises when a party uses another's land in a manner that is continuous, open, and adverse to the owner's interests. In this case, Alice's lack of objection strengthens Bob's claim. The first incorrect answer states that Bob does not have an easement because Alice never granted permission, but this misinterprets the nature of prescriptive easements, where permission is not required. The third answer incorrectly suggests that Bob has an easement by necessity; such easements apply only when a landlocked property requires access to a road, which is not the situation here. Lastly, the fourth option claims Bob has a license, which is revocable and does not grant any permanent rights to use the land, contradicting the nature of a prescriptive easement that grants a right of use that cannot be revoked once established.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100234592,
      "generatedAt": 1755100174592
    },
    {
      "qid": "fresh_openai_1755100168577_947201ea",
      "subject": "Property",
      "topic": "Estates",
      "stem": "Alice conveys her property to Bob 'for life, then to Charlie.' After Bob's death, Charlie conveys the property to David. Bob passes away, and Charlie has not yet died. What is the status of the property now?",
      "choices": [
        "The property is owned by Charlie for life.",
        "The property is owned by Charlie in fee simple.",
        "The property is owned by Bob's estate.",
        "The property is owned by David in fee simple."
      ],
      "correctIndex": 0,
      "explanation": "The correct answer is that the property is owned by Charlie for life. Bob holds a life estate, and upon his death, the property will revert to Charlie as the life tenant.",
      "explanationLong": "The correct answer is that the property is owned by Charlie for life. Bob holds a life estate, which means he has the right to use and enjoy the property during his lifetime. Upon Bob's death, the property passes to Charlie, who has a remainder interest. Since Charlie is still alive, he holds a life estate in the property, which means he has the right to occupy it until his death. The other options are incorrect because: (1) The property is not owned by Charlie in fee simple, as he only has a life estate at this point (Answer A). (2) David cannot own the property in fee simple because he received it from Charlie, who only has a life estate (Answer B). (3) Bob's estate does not have an interest in the property after his death, as the property passed to Charlie (Answer C). Therefore, the only correct answer is that Charlie owns the property for life.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100228577,
      "generatedAt": 1755100168577
    },
    {
      "qid": "fresh_openai_1755100170225_cff6ddc8",
      "subject": "Property",
      "topic": "Recording Acts",
      "stem": "Alice owns a parcel of land. On January 1, she sells the land to Bob but does not record the deed. On January 15, Alice sells the same land to Carol and records her deed the same day. Carol had no knowledge of the prior sale to Bob. On January 20, Bob records his deed. Who has superior title to the land?",
      "choices": [
        "Carol, because she was a bona fide purchaser without notice.",
        "Both, because they both have valid deeds.",
        "Neither, because Alice did not have the authority to sell the land.",
        "Bob, because he recorded his deed first."
      ],
      "correctIndex": 0,
      "explanation": "Carol has superior title because she is a bona fide purchaser for value without notice and recorded her deed before Bob.",
      "explanationLong": "The correct answer is Carol, because she is a bona fide purchaser (BFP) who took the property without notice of Bob's prior claim and recorded her deed first. Under the race-notice recording statute, a BFP is protected against prior unrecorded interests if they record first and lack notice of those interests. Bob, although he recorded his deed, did so after Carol had already recorded hers, making Carol's claim superior. The incorrect answers are as follows: (1) Bob's claim is invalid because he had notice of the sale to Carol when he recorded on January 20, and thus he is not a BFP. (3) The claim that neither has title fails because both have valid deeds; Alice had the authority to sell unless there are other factors not stated here. (4) The assertion that both have valid deeds misapplies the race-notice rule, as only one can hold superior title at a time based on the recording and notice status.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100230225,
      "generatedAt": 1755100170225
    },
    {
      "qid": "fresh_openai_1755100323164_a1e63371",
      "subject": "Property",
      "topic": "Estates",
      "stem": "Alice owned a parcel of land and decided to convey it to Bob 'for life.' After Bob's death, Alice specified that the property should go to Carol. Upon Bob's death, Carol claims ownership of the property. What type of estate does Bob hold in the property?",
      "choices": [
        "A fee simple determinable",
        "A remainder interest",
        "A life estate",
        "A fee simple absolute"
      ],
      "correctIndex": 2,
      "explanation": "Bob holds a life estate in the property, which is a present interest that lasts for the duration of his life.",
      "explanationLong": "The correct answer is that Bob holds a life estate. A life estate is an estate that lasts for the life of the grantee, in this case, Bob. Upon Bob's death, the property will transfer to Carol, who has a remainder interest contingent on Bob's life estate. The conveyance 'for life' clearly indicates that Bob's interest is limited to his lifetime, fulfilling the requirement for a life estate. The incorrect answers are as follows: (1) A fee simple absolute grants complete ownership and would not limit the estate to Bob's life; hence, it does not apply here. (2) A fee simple determinable involves a condition that could terminate the estate automatically upon the occurrence of a specified event, which is not present in this conveyance. (3) A remainder interest is not an estate held by Bob; it is Carol's future interest that will take effect after Bob's life estate ends. Therefore, the only accurate characterization of Bob's interest is a life estate.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100383164,
      "generatedAt": 1755100323164
    },
    {
      "qid": "fresh_openai_1755100324492_2bc37feb",
      "subject": "Property",
      "topic": "Recording Acts",
      "stem": "Alice owns a parcel of land and conveys it to Bob in a written deed. Bob does not record the deed immediately. Later, Alice conveys the same parcel of land to Charlie, who is unaware of Bob's interest and records his deed first. Which party has superior title to the property?",
      "choices": [
        "Alice, because she conveyed the property to both Bob and Charlie.",
        "Bob, because he had possession of the property before Charlie recorded his deed.",
        "Charlie, because he recorded his deed first and had no notice of Bob's interest.",
        "Bob, because he was the first to receive the deed from Alice."
      ],
      "correctIndex": 2,
      "explanation": "Charlie has superior title because he is a bona fide purchaser (BFP) who recorded first and had no notice of Bob's interest.",
      "explanationLong": "The correct answer is Charlie, as he is a bona fide purchaser (BFP) who recorded his deed first and had no notice of Bob's prior interest. Under the race-notice recording statute, a BFP who takes without notice of a prior interest and records first will prevail over prior unrecorded interests. Here, Charlie's lack of notice regarding Bob's deed allows him to claim superior title despite Bob's earlier acquisition. Bob's failure to record his deed means he cannot protect his interest against Charlie, who did record. The other answer options are incorrect: (1) Bob does not have superior title simply because he received the deed first; he failed to record it, thus losing his rights under the race-notice statute. (2) Alice cannot claim title because she conveyed the property to two parties; her action does not grant her superior rights. (3) Bob's possession before Charlie's recording does not confer superior title under the race-notice rule, as possession alone does not defeat Charlie's recorded interest.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100384492,
      "generatedAt": 1755100324492
    },
    {
      "qid": "fresh_openai_1755100322586_0a003e59",
      "subject": "Property",
      "topic": "Recording Acts",
      "stem": "Alice and Bob enter into a contract for the sale of Alice's land. After executing the contract, Alice sells the same land to Charlie, who is a bona fide purchaser (BFP) and does not know about the contract with Bob. Charlie promptly records his deed. Bob, unaware of Charlie's transaction, later records his contract with Alice. Who has superior rights to the property?",
      "choices": [
        "Bob has superior rights because he made a prior contract with Alice.",
        "Charlie has superior rights because he recorded first and is a bona fide purchaser without notice.",
        "Bob has superior rights because he recorded his contract after Alice's sale to Charlie.",
        "Alice retains superior rights because she sold to Charlie after the contract with Bob."
      ],
      "correctIndex": 1,
      "explanation": "Charlie has superior rights as a bona fide purchaser who recorded first.",
      "explanationLong": "The correct answer is that Charlie has superior rights because he is a bona fide purchaser (BFP) who recorded his deed first without notice of Bob's prior contract with Alice. Under the race-notice statute, a BFP who records first has priority over any subsequent purchasers who do not have notice of prior interests. In this case, Charlie's lack of notice of Bob's contract and his timely recording give him superior rights. Bob's position is weakened because he did not record before Charlie and lacks the status of a BFP. The second answer is incorrect because Bob's recording after Charlie does not give him rights superior to Charlie's. The third answer incorrectly suggests that Alice retains any rights; she cannot convey good title to Charlie after contracting with Bob. The fourth answer is also incorrect because simply having a prior contract does not confer superior rights unless it is recorded before the subsequent purchaser's deed, which did not happen here.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100382586,
      "generatedAt": 1755100322586
    }
  ],
  "Civ Pro": [
    {
      "qid": "fresh_openai_1755099868820_48280c01",
      "subject": "Civ Pro",
      "topic": "General",
      "stem": "A plaintiff files a lawsuit in a federal court based on diversity jurisdiction, alleging that the defendant breached a contract. The plaintiff is a citizen of California, while the defendant is a citizen of Nevada. The amount in controversy is $75,000. After the defendant files an answer, the plaintiff realizes that the defendant also has a principal place of business in California. Can the federal court continue to hear the case based on diversity jurisdiction?",
      "choices": [
        "Yes, because the amount in controversy exceeds $75,000.",
        "No, because diversity must exist at the time the lawsuit is filed.",
        "No, because the defendant is a citizen of California.",
        "Yes, as long as the plaintiff's claim is valid."
      ],
      "correctIndex": 2,
      "explanation": "The correct answer is 'No, because the defendant is a citizen of California.' Diversity jurisdiction requires complete diversity, meaning no plaintiff can be from the same state as any defendant.",
      "explanationLong": "The correct answer is 'No, because the defendant is a citizen of California.' Under 28 U.S.C. § 1332, diversity jurisdiction requires complete diversity of citizenship between the parties. In this case, both the plaintiff and the defendant are citizens of California, which destroys diversity and thus precludes federal jurisdiction based on diversity, regardless of the amount in controversy being over $75,000. The first choice is incorrect because while the amount in controversy requirement is met, diversity must also be complete, which is not the case here. The third choice is misleading because the validity of the claim is irrelevant if jurisdiction is lacking due to lack of diversity. The fourth choice is partially correct but does not fully address the reason for the jurisdictional failure; it is not just about diversity existing at the time of filing, but also about it being maintained throughout the case, and here it was never present due to the defendant's citizenship.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099928820,
      "generatedAt": 1755099868820
    },
    {
      "qid": "fresh_openai_1755099870881_af141c52",
      "subject": "Civ Pro",
      "topic": "General",
      "stem": "A plaintiff files a lawsuit in a federal district court based on diversity jurisdiction, claiming $100,000 in damages against a defendant who resides in the same state as the plaintiff. The plaintiff alleges that the defendant breached a contract. The defendant moves to dismiss the case for lack of subject matter jurisdiction. What is the likely outcome of the motion to dismiss?",
      "choices": [
        "The motion to dismiss will be denied because the amount in controversy exceeds $75,000.",
        "The motion to dismiss will be denied because the plaintiff's claim is based on a state law breach of contract.",
        "The motion to dismiss will be granted because the plaintiff failed to establish a federal question.",
        "The motion to dismiss will be granted because the parties are not diverse."
      ],
      "correctIndex": 3,
      "explanation": "The correct answer is that the motion to dismiss will be granted because the parties are not diverse.",
      "explanationLong": "The correct answer is that the motion to dismiss will be granted because the parties are not diverse. Under 28 U.S.C. § 1332, diversity jurisdiction requires that the parties be citizens of different states, and in this case, both the plaintiff and defendant are residents of the same state, which defeats diversity jurisdiction. Answer choice B incorrectly states that the amount in controversy is sufficient; however, without diversity of citizenship, the federal court lacks jurisdiction regardless of the amount. Answer choice C is incorrect because the case does not involve a federal question; it is purely a state law breach of contract claim. Answer choice D incorrectly suggests that the denial of the motion is based on the nature of the claim; however, the critical issue here is the lack of diversity, which is a prerequisite for federal jurisdiction in this scenario.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099930881,
      "generatedAt": 1755099870882
    },
    {
      "qid": "fresh_openai_1755099869298_7ad6c6cd",
      "subject": "Civ Pro",
      "topic": "General",
      "stem": "In a diversity jurisdiction case, Plaintiff filed a lawsuit in federal court against Defendant, who resides in the same state as Plaintiff. Defendant moves to dismiss the case based on lack of subject matter jurisdiction. Which of the following is the most appropriate ruling for the court?",
      "choices": [
        "The motion to dismiss should be denied because the case can proceed under federal question jurisdiction.",
        "The motion to dismiss should be granted because the amount in controversy does not exceed $75,000.",
        "The motion to dismiss should be granted because there is no complete diversity between the parties.",
        "The motion to dismiss should be denied because the federal court has supplemental jurisdiction."
      ],
      "correctIndex": 2,
      "explanation": "The correct answer is that the motion to dismiss should be granted due to lack of complete diversity between the parties.",
      "explanationLong": "The correct answer is that the motion to dismiss should be granted because there is no complete diversity between the parties. Under 28 U.S.C. § 1332, federal courts have diversity jurisdiction when the parties are citizens of different states and the amount in controversy exceeds $75,000. Here, both Plaintiff and Defendant reside in the same state, which destroys complete diversity, making the federal court unable to exercise jurisdiction over this case. Answer choice B is incorrect because supplemental jurisdiction does not apply when there is no original jurisdiction based on diversity. Choice C is wrong because the issue is not the amount in controversy but the lack of diversity. Lastly, D is incorrect because there is no federal question jurisdiction present, as the question does not present any federal law or constitutional issue, only a state law matter between parties from the same state.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099929298,
      "generatedAt": 1755099869299
    },
    {
      "qid": "fresh_openai_1755100174047_0ea54019",
      "subject": "Civ Pro",
      "topic": "General",
      "stem": "Alice, a resident of State A, sues Bob, a resident of State B, in federal court for breach of contract. The amount in controversy is $75,000. Bob argues that the case should be dismissed for lack of subject matter jurisdiction. Which of the following is the most accurate statement regarding the jurisdictional issue?",
      "choices": [
        "The federal court has subject matter jurisdiction under diversity jurisdiction because the parties are from different states and the amount in controversy exceeds $75,000.",
        "The federal court has subject matter jurisdiction under federal question jurisdiction due to the nature of the breach of contract claim.",
        "The federal court lacks subject matter jurisdiction because the amount in controversy does not exceed $100,000.",
        "The federal court lacks subject matter jurisdiction because Alice and Bob are both citizens of the United States."
      ],
      "correctIndex": 0,
      "explanation": "The federal court has subject matter jurisdiction under diversity jurisdiction because the parties are from different states and the amount in controversy exceeds $75,000.",
      "explanationLong": "The correct answer is the first choice, which explains that the federal court has subject matter jurisdiction under diversity jurisdiction. Under 28 U.S.C. § 1332, federal courts have jurisdiction over civil actions between citizens of different states where the amount in controversy exceeds $75,000. Here, Alice is a resident of State A and Bob is a resident of State B, satisfying the diversity requirement, and the amount in controversy is $75,000, which meets the threshold. The second choice is incorrect because it misapplies the concept of citizenship; both parties being U.S. citizens does not negate diversity jurisdiction as long as they are from different states. The third choice is incorrect because breach of contract claims generally do not present a federal question unless they arise under federal law; therefore, federal question jurisdiction under 28 U.S.C. § 1331 does not apply here. The fourth choice is also incorrect because the amount in controversy is indeed $75,000, which exceeds the jurisdictional minimum for diversity jurisdiction, not $100,000.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100234047,
      "generatedAt": 1755100174048
    },
    {
      "qid": "fresh_openai_1755100169250_4c384c76",
      "subject": "Civ Pro",
      "topic": "General",
      "stem": "In a federal district court, Plaintiff sues Defendant for breach of contract, alleging damages of $75,000. The complaint was properly served, but Defendant failed to respond within the required time frame. Plaintiff then filed a motion for default judgment. Which of the following is TRUE regarding the default judgment?",
      "choices": [
        "Plaintiff must prove damages to the court even if a default judgment is entered.",
        "The court can only grant a default judgment if the amount in controversy exceeds $100,000.",
        "Defendant can later contest the default judgment without showing good cause.",
        "The court will automatically grant the default judgment without a hearing."
      ],
      "correctIndex": 0,
      "explanation": "The correct answer is that Plaintiff must prove damages to the court even if a default judgment is entered, as per Rule 55 of the Federal Rules of Civil Procedure.",
      "explanationLong": "The correct answer is that Plaintiff must prove damages to the court even if a default judgment is entered. Under Federal Rule of Civil Procedure 55(b), when a party seeks a default judgment, the court must ensure that the plaintiff proves the amount of damages, as the default itself does not automatically establish the amount of damages. The other options are incorrect: Option 0 is wrong because the court does not automatically grant a default judgment without assessing the damages; a hearing may be required. Option 2 is incorrect because Defendant cannot contest a default judgment without demonstrating good cause for the failure to respond, as per Rule 55(c). Lastly, Option 3 is incorrect because there is no minimum amount in controversy requirement for default judgments; the jurisdictional threshold of $75,000 is sufficient for federal diversity jurisdiction, but it does not limit the court's ability to enter a default judgment based on the pleaded amount.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100229250,
      "generatedAt": 1755100169250
    },
    {
      "qid": "fresh_openai_1755100172821_fea972ee",
      "subject": "Civ Pro",
      "topic": "General",
      "stem": "In a negligence lawsuit, Plaintiff filed a complaint against Defendant in federal district court based on diversity jurisdiction, claiming damages of $75,000. Defendant, a citizen of California, moved to dismiss the case, arguing that the amount in controversy did not meet the jurisdictional threshold. After reviewing the complaint, the court found that Plaintiff's claims included both economic and non-economic damages. What is the correct ruling regarding the court's jurisdiction?",
      "choices": [
        "The court lacks jurisdiction because the amount in controversy is not clearly stated.",
        "The court has jurisdiction only if Plaintiff can prove the amount in controversy at trial.",
        "The court has jurisdiction because the amount in controversy exceeds $75,000.",
        "The court lacks jurisdiction because Defendant is a citizen of California."
      ],
      "correctIndex": 2,
      "explanation": "The court has jurisdiction because the amount in controversy exceeds $75,000, which meets the requirements for diversity jurisdiction.",
      "explanationLong": "The correct answer is that the court has jurisdiction because the amount in controversy exceeds $75,000. Under 28 U.S.C. § 1332, federal courts have diversity jurisdiction when the parties are citizens of different states and the amount in controversy exceeds $75,000. In this case, Plaintiff is asserting a claim for $75,000, which satisfies the threshold requirement for jurisdiction. The second option is incorrect because the amount in controversy is stated in the complaint, and the court is obligated to accept the plaintiff's good faith allegations unless it is clear to a legal certainty that the amount is not met. The third option is also incorrect because the burden of proof regarding the amount in controversy does not shift to the plaintiff at trial; it is determined at the time of filing based on the allegations in the complaint. Lastly, the fourth option is incorrect because diversity jurisdiction does not require that the defendant be from a different state than the plaintiff; it only requires that the parties be citizens of different states, which is satisfied here as the plaintiff is not a citizen of California.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100232821,
      "generatedAt": 1755100172821
    },
    {
      "qid": "fresh_openai_1755100324143_5c24c6e0",
      "subject": "Civ Pro",
      "topic": "General",
      "stem": "In a federal civil lawsuit, Plaintiff files a complaint against Defendant in the wrong district court due to a miscalculation of the proper venue. After Defendant raises the issue of improper venue in their answer, Plaintiff seeks to amend the complaint to file in the correct district. Which of the following statements is true regarding the amendment and venue in this scenario?",
      "choices": [
        "The amendment will be denied because the original complaint was filed in the wrong venue.",
        "Plaintiff must demonstrate that the original venue was improper to amend the complaint.",
        "Plaintiff can amend the complaint to change the venue to the correct district without any limitations.",
        "Defendant can object to the amendment based on the doctrine of laches."
      ],
      "correctIndex": 1,
      "explanation": "Plaintiff must demonstrate that the original venue was improper to amend the complaint.",
      "explanationLong": "The correct answer is that Plaintiff must demonstrate that the original venue was improper to amend the complaint. Under 28 U.S.C. § 1446(b)(3), if a case is filed in an improper venue, a party may amend their pleadings to correct the venue issue, but must show the initial complaint was filed incorrectly. The first option is incorrect because while Plaintiff may amend, they cannot do so without addressing the initial venue issue. The third option is incorrect as the doctrine of laches applies to equitable defenses and does not pertain to procedural venue issues. The fourth option is misleading because while the original complaint was indeed filed in the wrong venue, the amendment procedure allows for correction if proper grounds are established, thus denying the amendment solely based on the initial error is not accurate.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100384143,
      "generatedAt": 1755100324143
    },
    {
      "qid": "fresh_openai_1755100326789_6cd8e642",
      "subject": "Civ Pro",
      "topic": "General",
      "stem": "In a diversity case, Plaintiff, a citizen of State A, sues Defendant, a citizen of State B, for breach of contract in a federal district court. The amount in controversy exceeds $75,000. After the complaint is filed, Defendant moves to dismiss the case for lack of personal jurisdiction, arguing that he does not have sufficient contacts with State A. Which of the following is the most likely outcome of Defendant's motion to dismiss?",
      "choices": [
        "The motion to dismiss will be denied because the amount in controversy exceeds $75,000.",
        "The motion to dismiss will be granted if Defendant can prove he has no business or personal ties to State A.",
        "The motion to dismiss will be denied if Defendant's activities in State A are sufficient to establish minimum contacts.",
        "The motion to dismiss will be granted because Defendant has no contacts with State A."
      ],
      "correctIndex": 2,
      "explanation": "The correct answer is that the motion to dismiss will be denied if Defendant's activities in State A are sufficient to establish minimum contacts, which is necessary for personal jurisdiction.",
      "explanationLong": "The correct answer is that the motion to dismiss will be denied if Defendant's activities in State A are sufficient to establish minimum contacts. Under the Due Process Clause, a court may exercise personal jurisdiction over a defendant if that defendant has established minimum contacts with the forum state, such that the exercise of jurisdiction does not offend traditional notions of fair play and substantial justice. In this scenario, if Defendant has engaged in activities in State A that create a substantial connection, personal jurisdiction would be appropriate. Answer A is incorrect because lack of contacts alone does not automatically grant a motion to dismiss; it depends on the nature and quality of those contacts. Answer B is incorrect because the amount in controversy is not relevant to personal jurisdiction but rather to subject matter jurisdiction. Finally, Answer D is incorrect because the burden is on Defendant to demonstrate a lack of minimum contacts, not just to prove a lack of business or personal ties. Thus, the correct answer emphasizes the requirement of minimum contacts for a denial of the motion to dismiss.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100386789,
      "generatedAt": 1755100326790
    },
    {
      "qid": "fresh_openai_1755100333408_389a5ef4",
      "subject": "Civ Pro",
      "topic": "General",
      "stem": "In a civil lawsuit concerning a breach of contract, Plaintiff files a complaint in a federal district court. Defendant moves to dismiss the complaint for lack of personal jurisdiction, arguing that he is a resident of another state and has not conducted any business in the state where the court is located. Plaintiff argues that Defendant has established sufficient minimum contacts with the forum state through a series of email communications and phone calls related to the contract negotiations. Which of the following is the most likely outcome regarding the motion to dismiss?",
      "choices": [
        "The court will grant the motion to dismiss because the Plaintiff did not serve Defendant properly.",
        "The court will grant the motion to dismiss because Defendant is a resident of another state and has no physical presence in the forum state.",
        "The court will deny the motion to dismiss because the breach of contract occurred in the forum state.",
        "The court will deny the motion to dismiss because Defendant's email communications and phone calls establish minimum contacts with the forum state."
      ],
      "correctIndex": 3,
      "explanation": "The correct answer is that the court will deny the motion to dismiss because Defendant's email communications and phone calls establish minimum contacts with the forum state.",
      "explanationLong": "The correct answer is (A). Under the Due Process Clause, a court may exercise personal jurisdiction over a defendant if the defendant has sufficient minimum contacts with the forum state that do not offend traditional notions of fair play and substantial justice. Here, Defendant's email communications and phone calls demonstrate purposeful availment of the forum state's laws, thus establishing minimum contacts. Answer (B) is incorrect because mere residency and lack of physical presence do not automatically preclude personal jurisdiction if minimum contacts exist. Answer (C) is incorrect because the location of the breach is not the sole factor; the nature of the contacts is crucial in determining jurisdiction. Finally, answer (D) is incorrect because the question does not provide any facts suggesting improper service of process; thus, the motion to dismiss on those grounds is unfounded.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100393408,
      "generatedAt": 1755100333408
    }
  ],
  "Evidence": [
    {
      "qid": "fresh_openai_1755099867480_016056fb",
      "subject": "Evidence",
      "topic": "Relevance 401/403",
      "stem": "In a personal injury lawsuit, the plaintiff seeks to introduce evidence of the defendant's prior unrelated criminal conviction for theft to demonstrate the defendant's character for being dishonest. The defendant objects, arguing that the evidence is not relevant to the issues at hand. How should the court rule on the admissibility of the evidence?",
      "choices": [
        "The court should exclude the evidence because it is not relevant to the plaintiff's claims.",
        "The court should admit the evidence because it is relevant to the credibility of the defendant as a witness.",
        "The court should exclude the evidence because the probative value is substantially outweighed by the danger of unfair prejudice.",
        "The court should admit the evidence because it shows the defendant's character for dishonesty."
      ],
      "correctIndex": 2,
      "explanation": "The correct answer is that the court should exclude the evidence because the probative value is substantially outweighed by the danger of unfair prejudice.",
      "explanationLong": "The correct answer is that the court should exclude the evidence because the probative value is substantially outweighed by the danger of unfair prejudice under Rule 403 of the Federal Rules of Evidence. While evidence of a prior conviction may be relevant under Rule 401, in this case, the conviction for theft is unrelated to the personal injury claim and primarily serves to cast the defendant in a negative light, which can unfairly influence the jury. Answer A is incorrect because it overlooks Rule 403's balancing test; being dishonest is not directly relevant to the issues of the case. Answer B is incorrect as it misapplies the relevance standard; the defendant's character for dishonesty does not enhance credibility in the context of this personal injury case. Answer C is partially correct in noting the lack of relevance but fails to address the unfair prejudice concern that Rule 403 highlights, making it less comprehensive than the correct answer.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099927480,
      "generatedAt": 1755099867480
    },
    {
      "qid": "fresh_openai_1755099867732_b8532603",
      "subject": "Evidence",
      "topic": "Privileges",
      "stem": "During a civil lawsuit for breach of contract, the plaintiff's attorney seeks to introduce a conversation between the plaintiff and his psychiatrist regarding the plaintiff's emotional distress caused by the breach. The psychiatrist is prepared to testify about the content of that conversation. What is the most likely outcome regarding the admissibility of this testimony?",
      "choices": [
        "The testimony is inadmissible because it is hearsay.",
        "The testimony is admissible because it relates to the plaintiff's emotional state.",
        "The testimony is inadmissible due to the doctor-patient privilege.",
        "The testimony is admissible because the plaintiff waived the privilege by discussing the conversation with his attorney."
      ],
      "correctIndex": 2,
      "explanation": "The correct answer is that the testimony is inadmissible due to the doctor-patient privilege, which protects confidential communications between a patient and their psychiatrist.",
      "explanationLong": "The correct answer is that the testimony is inadmissible due to the doctor-patient privilege, which protects confidential communications made for the purpose of diagnosis or treatment. In this case, the conversation between the plaintiff and his psychiatrist is protected under this privilege, meaning the psychiatrist cannot disclose what was discussed without the plaintiff's consent. Answer A is incorrect because the relevance of the testimony does not override the privilege. Answer C is incorrect because there is no indication in the facts that the plaintiff waived the privilege; merely discussing his emotional state does not constitute a waiver. Answer D is incorrect because the issue at hand is not hearsay but rather the application of a privilege, which is a separate evidentiary rule that protects certain communications from disclosure in court.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099927732,
      "generatedAt": 1755099867732
    },
    {
      "qid": "fresh_openai_1755099872381_75646023",
      "subject": "Evidence",
      "topic": "Hearsay 801–807",
      "stem": "During a robbery trial, the prosecution called Jane, who testified that she saw the defendant commit the robbery. Jane then recalled that, shortly after the event, she pointed out the defendant to a police officer at the scene. The defense objected to the introduction of Jane's identification of the defendant to the officer as hearsay. How should the court rule on the objection?",
      "choices": [
        "The court should sustain the objection because the identification was not made in court and lacks proper foundation.",
        "The court should sustain the objection because the identification was made out of court and is therefore hearsay.",
        "The court should overrule the objection because Jane's identification is a prior identification and non-hearsay under FRE 801(d)(1)(C).",
        "The court should overrule the objection because the identification is admissible as a spontaneous declaration."
      ],
      "correctIndex": 2,
      "explanation": "The correct answer is that the court should overrule the objection because Jane's identification is a prior identification and non-hearsay under FRE 801(d)(1)(C).",
      "explanationLong": "The correct answer is that the court should overrule the objection because Jane's identification of the defendant to the police officer is a prior identification and is therefore non-hearsay under FRE 801(d)(1)(C). This rule allows for the admission of prior identifications as evidence if the witness testifies at trial and is subject to cross-examination. Here, Jane is testifying in court and can be cross-examined about her identification, fulfilling the requirements of the rule. The first wrong answer is incorrect because it misstates the nature of the objection; the identification is not hearsay and is admissible. The second wrong answer incorrectly asserts that any out-of-court statement is hearsay, failing to recognize the exception for prior identifications. The third wrong answer is incorrect because the identification does not require additional foundation if it qualifies as a prior identification under the rules. Lastly, the fourth wrong answer incorrectly cites spontaneous declarations, which do not apply here as the identification was made after the event and not in an immediate emotional response.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099932381,
      "generatedAt": 1755099872381
    },
    {
      "qid": "fresh_openai_1755100174234_e2f2ad16",
      "subject": "Evidence",
      "topic": "Hearsay 801–807",
      "stem": "During a robbery trial, the prosecution calls a witness who testifies that she saw the defendant commit the robbery. The witness had previously identified the defendant in a police lineup shortly after the robbery occurred. The defense objects to the witness's testimony about the lineup identification, arguing that it constitutes hearsay. How should the court rule on the objection?",
      "choices": [
        "The court should sustain the objection because the witness's identification was not made in court.",
        "The court should sustain the objection because the prior identification is an out-of-court statement offered for the truth of the matter asserted.",
        "The court should overrule the objection because the witness's prior identification is not considered hearsay under FRE 801(d)(1)(C).",
        "The court should overrule the objection because the witness's testimony is merely corroborative of other evidence."
      ],
      "correctIndex": 2,
      "explanation": "The court should overrule the objection because the witness's prior identification is not considered hearsay under FRE 801(d)(1)(C).",
      "explanationLong": "The correct answer is that the court should overrule the objection because the witness's prior identification is admissible as non-hearsay under FRE 801(d)(1)(C). This rule states that a prior identification made by a witness is not considered hearsay if the witness testifies and is subject to cross-examination concerning the statement. In this case, the witness testified in court and identified the defendant, fulfilling the requirements of the rule. The first incorrect answer suggests that the identification is hearsay, which misinterprets the nature of prior identifications as exceptions to the hearsay rule. The second incorrect answer incorrectly assumes that the identification was made out of court and therefore cannot be used, failing to recognize that FRE 801(d)(1)(C) specifically provides for such identifications. The third incorrect answer misapplies the hearsay rule by suggesting that an out-of-court identification is inherently inadmissible without considering the specific exception provided by the rule. Lastly, the fourth incorrect choice mischaracterizes the nature of the evidence, as corroborative evidence does not negate the admissibility of the prior identification under the hearsay rules.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100234234,
      "generatedAt": 1755100174234
    },
    {
      "qid": "fresh_openai_1755100167616_08baf596",
      "subject": "Evidence",
      "topic": "Privileges",
      "stem": "During a criminal trial, the defendant's attorney attempts to introduce a statement made by the defendant to his therapist during a counseling session. The prosecution objects, arguing that the statement is inadmissible. Which of the following is the most likely outcome regarding the admissibility of the statement?",
      "choices": [
        "The statement is admissible because it is relevant to the defendant's mental state.",
        "The statement is inadmissible as hearsay.",
        "The statement is admissible because it is a declaration against interest.",
        "The statement is inadmissible due to the therapist-client privilege."
      ],
      "correctIndex": 3,
      "explanation": "The correct answer is that the statement is inadmissible due to the therapist-client privilege, which protects confidential communications between a therapist and a patient.",
      "explanationLong": "The correct answer is that the statement is inadmissible due to the therapist-client privilege. This privilege is designed to encourage open communication between patients and therapists, thus protecting those communications from disclosure in court. In this case, the defendant's statement to his therapist falls under this privilege, making it inadmissible as evidence. The first answer is incorrect because a declaration against interest does not apply here; this privilege is specifically designed for confidential communications, not declarations that would be self-incriminating. The third option is also incorrect because while a defendant's mental state might be relevant, the privilege still protects the statement from being disclosed. Lastly, the fourth answer is wrong because the statement is not hearsay; it is a privileged communication rather than an out-of-court statement offered for the truth of the matter asserted. Thus, the therapist-client privilege is the controlling rule here.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100227616,
      "generatedAt": 1755100167616
    },
    {
      "qid": "fresh_openai_1755100173048_bdda1f1f",
      "subject": "Evidence",
      "topic": "Relevance 401/403",
      "stem": "During a trial for theft, the prosecution seeks to introduce evidence that the defendant had previously been convicted of shoplifting. The defendant argues that this evidence should be excluded because it is not relevant to the current charge. Under the rules of evidence, should the court admit this prior conviction?",
      "choices": [
        "Yes, because prior convictions are always admissible in criminal cases.",
        "Yes, because it shows a pattern of behavior that is relevant to the current charge.",
        "No, because the prior conviction does not relate directly to the specific act of theft being charged.",
        "No, because the prejudicial effect of the prior conviction outweighs its probative value."
      ],
      "correctIndex": 3,
      "explanation": "The correct answer is 'No, because the prejudicial effect of the prior conviction outweighs its probative value.' This is based on Rule 403, which allows for exclusion of relevant evidence if its probative value is substantially outweighed by the danger of unfair prejudice.",
      "explanationLong": "The correct answer is 'No, because the prejudicial effect of the prior conviction outweighs its probative value.' Under Rule 401, evidence is relevant if it makes a fact of consequence more or less probable. However, under Rule 403, relevant evidence may be excluded if its probative value is substantially outweighed by the danger of unfair prejudice. In this case, the prior conviction for shoplifting may unfairly suggest to the jury that the defendant has a propensity to commit theft, leading to prejudice rather than a fair assessment of the current charges. The other choices are incorrect because: (1) 'Yes, because it shows a pattern of behavior that is relevant to the current charge' misapplies the relevance standard, as past behavior does not necessarily indicate current guilt; (2) 'Yes, because prior convictions are always admissible in criminal cases' is incorrect because admissibility is subject to the balancing test of Rule 403; (3) 'No, because the prior conviction does not relate directly to the specific act of theft being charged' is a misinterpretation, as the focus should be on the prejudicial impact rather than direct relevance to the act.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100233048,
      "generatedAt": 1755100173048
    },
    {
      "qid": "fresh_openai_1755100328554_63c08cee",
      "subject": "Evidence",
      "topic": "Experts",
      "stem": "In a personal injury lawsuit, the plaintiff presents an orthopedic surgeon as an expert witness to testify about the extent of the plaintiff's injuries and the necessary medical treatment. The defense attorney objects, arguing that the surgeon lacks expertise in the field of rehabilitation. How should the court rule on the objection?",
      "choices": [
        "Sustain the objection, as the surgeon is not a specialist in rehabilitation.",
        "Overrule the objection, as any qualified expert can provide testimony relevant to the case.",
        "Sustain the objection, as expert testimony must come from a practitioner in the exact field of the injury.",
        "Overrule the objection, as the surgeon's general expertise in orthopedics qualifies him to testify about the injuries."
      ],
      "correctIndex": 3,
      "explanation": "The correct answer is to overrule the objection, as the orthopedic surgeon's expertise qualifies him to testify regarding the injuries and treatment.",
      "explanationLong": "The correct answer is to overrule the objection, as the law allows an expert to testify if they possess knowledge, skill, experience, training, or education that qualifies them in the subject matter of the testimony. Here, the orthopedic surgeon has the relevant medical expertise to discuss the plaintiff's injuries and proposed treatment, even if he is not a specialist in rehabilitation. The objection is incorrect because it misapplies the standard for expert testimony, which does not require absolute specialization in every aspect of a case. The first choice is incorrect because the surgeon's qualifications in orthopedics are sufficient to provide relevant testimony. The third choice misstates the requirement for expert testimony by suggesting that only specialists in the exact field of injury can testify, which is not the law. The fourth choice is misleading as it implies any expert can testify about any area, which is not entirely accurate; the expert must still have relevant qualifications in the area of testimony.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100388554,
      "generatedAt": 1755100328554
    },
    {
      "qid": "fresh_openai_1755100330701_378a3e77",
      "subject": "Evidence",
      "topic": "Experts",
      "stem": "In a personal injury lawsuit, the plaintiff seeks to introduce expert testimony regarding the psychological effects of the accident on her mental health. The expert, a licensed psychologist, has conducted extensive research on trauma but has never evaluated the plaintiff personally. The defense objects to the expert's testimony on the grounds of insufficient foundation. Which of the following is the most likely outcome regarding the admissibility of the expert's testimony?",
      "choices": [
        "The testimony is inadmissible because it lacks relevance to the plaintiff's specific case.",
        "The testimony is inadmissible because the expert has not personally evaluated the plaintiff.",
        "The testimony is admissible because the expert's research qualifies as reliable evidence.",
        "The testimony is admissible as long as the expert's methods are generally accepted in the field."
      ],
      "correctIndex": 3,
      "explanation": "The correct answer is C: The testimony is admissible as long as the expert's methods are generally accepted in the field.",
      "explanationLong": "The correct answer is C. Under the Daubert standard, expert testimony is admissible if it is based on reliable methods and principles that are generally accepted in the expert's field, even if the expert has not personally evaluated the plaintiff. In this case, the psychologist's extensive research indicates that her methods are likely accepted in the field of trauma psychology, thereby supporting her testimony's admissibility. Answer A is incorrect because mere research does not automatically qualify as reliable evidence without showing that it meets the Daubert criteria. Answer B is incorrect because an expert is not required to evaluate the plaintiff personally to provide testimony, as long as the testimony is grounded in reliable and relevant methodology. Answer D is incorrect because the testimony regarding psychological effects is relevant to the plaintiff's claim, particularly as it pertains to damages resulting from the accident.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100390701,
      "generatedAt": 1755100330701
    },
    {
      "qid": "fresh_openai_1755100329216_67181361",
      "subject": "Evidence",
      "topic": "Experts",
      "stem": "In a personal injury lawsuit, the plaintiff intends to introduce testimony from an orthopedic surgeon who has not treated the plaintiff but has extensive experience in analyzing similar injuries. The defendant objects, arguing that the surgeon's testimony is not admissible because he lacks direct knowledge of the plaintiff's specific condition. How should the court rule on the admissibility of the surgeon's testimony?",
      "choices": [
        "The court should exclude the testimony because it does not meet the Daubert standard for scientific reliability.",
        "The court should exclude the testimony because the surgeon has not treated the plaintiff and lacks firsthand knowledge.",
        "The court should admit the testimony because the surgeon's expertise is relevant and can help the jury understand the medical issues.",
        "The court should admit the testimony only if the surgeon reviews the plaintiff's medical records prior to testifying."
      ],
      "correctIndex": 2,
      "explanation": "The court should admit the testimony because the surgeon's expertise is relevant and can help the jury understand the medical issues.",
      "explanationLong": "The correct answer is that the court should admit the testimony because the orthopedic surgeon's expertise is relevant and can assist the jury in understanding the medical issues at hand. Under Federal Rule of Evidence 702, an expert may testify if their specialized knowledge will help the trier of fact understand the evidence or determine a fact in issue. The surgeon's extensive experience in analyzing similar injuries qualifies him to offer relevant opinions even without having treated the plaintiff directly. The first incorrect answer suggests excluding the testimony due to lack of firsthand knowledge, which misapplies the rule since expert testimony can be based on knowledge and experience, not solely personal treatment. The second incorrect answer unnecessarily limits the admissibility of expert testimony by requiring treatment, which is not a requirement under the rules. The third incorrect answer implies that a review of medical records is a prerequisite for admissibility, which is not a requirement under Rule 702 and could lead to the exclusion of valuable expert insights. Lastly, the fourth incorrect answer misapplies the Daubert standard, which pertains to scientific evidence rather than general expert testimony based on experience, thus failing to recognize the relevance of the surgeon's qualifications.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100389216,
      "generatedAt": 1755100329216
    }
  ],
  "Torts": [
    {
      "qid": "fresh_openai_1755099875120_45212c85",
      "subject": "Torts",
      "topic": "Products Liability",
      "stem": "A consumer purchased a new model of a kitchen blender, which was advertised as being able to blend any food item without issue. Soon after purchase, while using it to blend a hard vegetable, the blender exploded, causing injury to the consumer. The consumer sues the manufacturer for product liability, claiming that the blender was defectively designed. Under the risk-utility test, which of the following is most likely to be the outcome of the lawsuit?",
      "choices": [
        "The manufacturer is not liable because the blender complied with all applicable safety standards.",
        "The manufacturer is not liable because the blender was used in a manner not intended by the manufacturer.",
        "The manufacturer is liable because the blender's design did not adequately account for the risk of explosion when blending hard items.",
        "The manufacturer is liable because the consumer's injuries were directly caused by a manufacturing defect."
      ],
      "correctIndex": 2,
      "explanation": "The correct answer is that the manufacturer is liable because the blender's design did not adequately account for the risk of explosion when blending hard items.",
      "explanationLong": "The correct answer is that the manufacturer is liable because the blender's design did not adequately account for the risk of explosion when blending hard items. Under the risk-utility test, a product is defectively designed if the risks of harm it poses outweigh its utility to consumers. Here, the blender's failure to safely blend hard vegetables suggests a design that does not prioritize consumer safety, leading to liability. The second choice is incorrect because even if the consumer used the blender in a manner not intended, the design should still be safe for reasonable use, including blending hard items. The third choice is incorrect as it misidentifies the defect as a manufacturing defect rather than a design defect; the facts do not indicate a flaw in the manufacturing process. The fourth choice is also incorrect because compliance with safety standards does not automatically absolve the manufacturer of liability if the product is still unreasonably dangerous due to its design.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099935120,
      "generatedAt": 1755099875120
    },
    {
      "qid": "fresh_openai_1755099868876_f7e9ba43",
      "subject": "Torts",
      "topic": "Defamation",
      "stem": "After a local newspaper published an article stating that a local politician, John, was under investigation for embezzlement, John lost a significant number of supporters and donations. The article was based on an anonymous tip but did not provide any sources or evidence to support the claim. John claims that the article is defamatory. Which of the following statements is TRUE regarding John's potential defamation claim?",
      "choices": [
        "John must prove that the statement was made with actual malice to succeed in his claim.",
        "John's claim will fail because the statement was based on an anonymous tip and lacks factual basis.",
        "John's claim will succeed because the newspaper is liable for publishing a false statement regardless of intent.",
        "John can succeed in a defamation claim because the statement was published and it harmed his reputation."
      ],
      "correctIndex": 0,
      "explanation": "The correct answer is that John must prove that the statement was made with actual malice to succeed in his claim, as he is a public figure.",
      "explanationLong": "The correct answer is that John must prove that the statement was made with actual malice to succeed in his claim. As a public figure, John is required to show that the defamatory statement was made with knowledge of its falsity or with reckless disregard for the truth (New York Times Co. v. Sullivan). In this case, the newspaper's reliance on an anonymous tip does not automatically shield it from liability, but it does mean that John must meet the higher standard of proof for actual malice. The first answer is incorrect because, although publication and harm are necessary for defamation, they are not sufficient for a public figure like John without proving actual malice. The second answer fails because, while the statement's basis is questionable, the absence of factual support does not negate John's need to prove actual malice. The fourth answer is incorrect because liability for defamation does not arise solely from the publication of a false statement; the intent behind the statement matters significantly, particularly for public figures.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099928876,
      "generatedAt": 1755099868876
    },
    {
      "qid": "fresh_openai_1755099871958_9a2c1ed1",
      "subject": "Torts",
      "topic": "Defamation",
      "stem": "A local newspaper published an article stating that a prominent businessman, John, was under investigation for embezzlement. The article included a quote from an anonymous source claiming they witnessed John taking money from the company. John was never charged with any crime, and the claims were false. After the article's publication, John lost several business contracts. What is the most likely outcome if John sues the newspaper for defamation?",
      "choices": [
        "John will likely win the lawsuit because the newspaper is responsible for the truthfulness of its sources.",
        "John will likely lose the lawsuit because he is a public figure and must prove actual malice.",
        "John will likely win the lawsuit because the statement was false and caused him harm.",
        "John will likely lose the lawsuit because the statement was made by an anonymous source."
      ],
      "correctIndex": 1,
      "explanation": "The correct answer is that John will likely lose the lawsuit because he is a public figure and must prove actual malice. Public figures must demonstrate that the defendant acted with actual malice, meaning they knew the statement was false or acted with reckless disregard for the truth.",
      "explanationLong": "The correct answer is that John will likely lose the lawsuit because he is a public figure and must prove actual malice. Under defamation law, public figures, like John, must show that the defendant made the false statement with knowledge of its falsity or reckless disregard for the truth (New York Times Co. v. Sullivan). Although the statement was false and caused John harm, he must meet this high burden of proof, which he likely cannot do based solely on the anonymous source’s claims. The first answer is incorrect because, while the statement was false and harmful, the actual malice standard for public figures is not satisfied. The second answer is incorrect because the source's anonymity does not absolve the newspaper of liability but rather relates to the evidentiary weight of the statement. The fourth answer is incorrect because, while newspapers have a duty to verify information, John must still meet the actual malice standard due to his status as a public figure, making this point irrelevant to his success in the lawsuit.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099931958,
      "generatedAt": 1755099871958
    },
    {
      "qid": "fresh_openai_1755100171610_e82335ee",
      "subject": "Torts",
      "topic": "Defamation",
      "stem": "A local newspaper published an article stating that John, a well-known community leader, was under investigation for embezzling funds from a charity he managed. The article cited an anonymous source but did not provide any evidence to support the claim. John was never charged with any crime and the investigation was later found to be baseless. John claims the article harmed his reputation. What is the likely outcome of John's defamation claim against the newspaper?",
      "choices": [
        "John will not prevail because the statement was an opinion, not a fact.",
        "John will prevail because the newspaper failed to verify the truth of the statement.",
        "John will not prevail because he is a public figure and must prove actual malice.",
        "John will prevail because the statement was false and damaging."
      ],
      "correctIndex": 2,
      "explanation": "John is likely to lose because he is a public figure and must prove actual malice to succeed in a defamation claim.",
      "explanationLong": "The correct answer is that John will not prevail because he is a public figure and must prove actual malice to succeed in a defamation claim. In defamation cases involving public figures, the plaintiff must demonstrate that the defendant made the false statement with knowledge of its falsity or with reckless disregard for the truth (New York Times Co. v. Sullivan). In this case, the newspaper cited an anonymous source, which could indicate they were acting on information they believed to be true, thus making it difficult for John to prove actual malice. The first answer is incorrect because, although the statement was false and damaging, John's status as a public figure raises the burden of proof. The second answer is wrong because the statement is factual in nature, not merely opinion; it asserts that John was under investigation for a crime. The fourth answer is misleading as it suggests that failure to verify the statement alone constitutes malice, which is not sufficient to meet the legal standard without proof of actual malice.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100231610,
      "generatedAt": 1755100171610
    },
    {
      "qid": "fresh_openai_1755100177308_81d9770c",
      "subject": "Torts",
      "topic": "Strict Liability",
      "stem": "A farmer owns a large, aggressive bull that he keeps in a fenced pasture. One day, the bull escapes through a broken fence and charges onto a nearby road, injuring a passing cyclist. The cyclist sues the farmer for the injuries sustained. Which of the following statements is true regarding the farmer's liability?",
      "choices": [
        "The farmer is strictly liable for the injuries caused by the bull because he owned a wild animal.",
        "The farmer is not liable because he took reasonable steps to maintain the fence.",
        "The farmer is strictly liable for the injuries because the bull had a history of aggression.",
        "The farmer is liable only if it can be shown that he was negligent in supervising the bull."
      ],
      "correctIndex": 0,
      "explanation": "The correct answer is that the farmer is strictly liable for the injuries caused by the bull because he owned a wild animal. Under strict liability, a defendant is liable for harm caused by certain types of animals, particularly those that are wild or inherently dangerous.",
      "explanationLong": "The correct answer is that the farmer is strictly liable for the injuries caused by the bull because he owned a wild animal. Under the doctrine of strict liability, an owner of a wild animal is liable for injuries caused by that animal regardless of the precautions taken. Here, the bull is considered a wild animal, and its escape and subsequent attack on the cyclist create strict liability on the part of the farmer. Answer B is incorrect because the farmer's reasonable steps to maintain the fence do not negate liability; strict liability does not depend on the owner's conduct. Answer C is incorrect because while the bull's history of aggression may be relevant to negligence claims, it is not necessary to establish strict liability for wild animals. Answer D is also incorrect because strict liability does not require a showing of negligence; the mere fact of ownership of a wild animal is enough to impose liability for any resulting injuries.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100237308,
      "generatedAt": 1755100177308
    },
    {
      "qid": "fresh_openai_1755100170045_723496de",
      "subject": "Torts",
      "topic": "Vicarious Liability",
      "stem": "During a company-sponsored retreat, employee Alice was driving a company vehicle to a team-building exercise when she negligently ran a red light and collided with another car, injuring its driver. The injured driver sues the company for damages. Which of the following statements is true regarding the company’s liability for Alice's actions?",
      "choices": [
        "The company is not vicariously liable because Alice was attending a social event.",
        "The company is vicariously liable because Alice was driving a company vehicle.",
        "The company is vicariously liable for Alice's actions because she was acting within the scope of her employment.",
        "The company is not vicariously liable because Alice was not performing her job duties at the time of the accident."
      ],
      "correctIndex": 2,
      "explanation": "The correct answer is that the company is vicariously liable for Alice's actions because she was acting within the scope of her employment during the incident.",
      "explanationLong": "The correct answer is that the company is vicariously liable for Alice's actions because she was acting within the scope of her employment. Under the doctrine of vicarious liability, an employer can be held responsible for the negligent acts of an employee if those acts occur within the course and scope of employment. In this case, Alice was driving a company vehicle to a work-related team-building exercise, which constitutes an activity related to her employment. Therefore, her negligence in running the red light is attributed to the company. The second choice is incorrect because Alice was indeed performing a work-related task at the time of the accident, thus fulfilling the 'scope of employment' requirement. The third choice is misleading because while driving a company vehicle is a factor, the key issue is whether she was acting within the scope of her employment, which she was. The fourth choice fails because attending a company-sponsored retreat is not merely a social event; it is a work-related function, which further supports the company's vicarious liability.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100230045,
      "generatedAt": 1755100170045
    },
    {
      "qid": "fresh_openai_1755100325525_8ae76856",
      "subject": "Torts",
      "topic": "Privacy",
      "stem": "Alice, a private citizen, discovered that her neighbor, Bob, had installed a hidden camera in her backyard, which recorded her private moments without her knowledge. Alice felt violated and decided to sue Bob for invasion of privacy. Which of the following statements is most accurate regarding Alice's potential claim?",
      "choices": [
        "Alice can successfully claim invasion of privacy because Bob's actions constitute an intrusion upon seclusion.",
        "Alice's claim will fail because she did not consent to being recorded in a public place.",
        "Alice can only claim invasion of privacy if she proves that Bob intended to harm her reputation.",
        "Alice cannot claim invasion of privacy because she was in a public area of her backyard."
      ],
      "correctIndex": 0,
      "explanation": "Alice's claim is valid as Bob's hidden camera constitutes an intrusion upon seclusion, which is a recognized invasion of privacy.",
      "explanationLong": "The correct answer is that Alice can successfully claim invasion of privacy because Bob's actions constitute an intrusion upon seclusion. The legal rule states that an invasion of privacy occurs when a person intentionally intrudes upon the solitude or seclusion of another in a way that is highly offensive to a reasonable person. In this case, Bob's installation of a hidden camera in Alice's backyard, an area where she has a reasonable expectation of privacy, clearly meets this definition. The incorrect answers fail for the following reasons: The second option is incorrect because a backyard is not a public area, and Alice had a reasonable expectation of privacy there. The third option is incorrect because the intent to harm her reputation is not required for an intrusion upon seclusion claim; the focus is on the act of intrusion itself. Lastly, the fourth option is wrong because Alice was not in a public place; her expectation of privacy in her backyard supports her claim regardless of consent to being recorded.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100385525,
      "generatedAt": 1755100325525
    },
    {
      "qid": "fresh_openai_1755100330264_b6548154",
      "subject": "Torts",
      "topic": "Products Liability",
      "stem": "A consumer purchased a new brand of kitchen blender that was marketed as having a safety feature to prevent it from operating unless the lid was securely fastened. After using the blender for the first time, the lid came off during operation, causing severe injuries to the consumer. The consumer sued the manufacturer for a design defect, claiming the blender was unreasonably dangerous. The manufacturer argued that the blender was designed properly and that the consumer misused the product by not securing the lid. Under the risk-utility test, which of the following is the most likely outcome of the lawsuit?",
      "choices": [
        "The consumer will prevail because the blender's design did not adequately protect against the risk of injury.",
        "The consumer will not prevail because the injuries were caused by the consumer's misuse of the blender.",
        "The consumer will prevail because the blender was marketed with a safety feature that failed.",
        "The consumer will not prevail because the manufacturer properly designed the blender according to industry standards."
      ],
      "correctIndex": 0,
      "explanation": "The correct answer is that the consumer will prevail because the blender's design did not adequately protect against the risk of injury, failing the risk-utility test.",
      "explanationLong": "The correct answer is that the consumer will prevail because the blender's design did not adequately protect against the risk of injury, as per the risk-utility test. This test evaluates whether the benefits of a product's design outweigh the risks of harm it poses. In this case, the blender's safety feature was ineffective, leading to serious injuries, suggesting that the design could be deemed unreasonably dangerous. The first wrong answer states that the manufacturer properly designed the blender according to industry standards, which does not absolve liability if the product is still unreasonably dangerous; merely adhering to standards does not guarantee safety. The second wrong answer incorrectly assumes that the consumer’s misuse is the sole cause of injury, but the design's inherent flaws are central to the liability claim. The third wrong answer overlooks the fact that the existence of a marketed safety feature does not negate the design defect; if the feature fails to function as intended, the design may still be considered defective. Thus, the consumer's claim is supported by the inadequacy of the design to prevent foreseeable harm.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100390264,
      "generatedAt": 1755100330264
    },
    {
      "qid": "fresh_openai_1755100331866_e8936ca7",
      "subject": "Torts",
      "topic": "Strict Liability",
      "stem": "A farmer owns a large farm where he raises exotic animals, including a zebra. One day, the zebra escapes and runs into a nearby town, causing panic and injuring several people. The injured parties sue the farmer for damages. Which of the following statements is true regarding the farmer's potential liability under strict liability principles?",
      "choices": [
        "The farmer is not liable because he took reasonable steps to secure the zebra.",
        "The farmer is strictly liable for the injuries caused by the zebra because it is a wild animal.",
        "The farmer is not liable because the injuries occurred off his property.",
        "The farmer is only liable if the zebra was known to be dangerous."
      ],
      "correctIndex": 1,
      "explanation": "The farmer is strictly liable for injuries caused by the zebra because it is classified as a wild animal under strict liability principles.",
      "explanationLong": "The correct answer is that the farmer is strictly liable for the injuries caused by the zebra because it is a wild animal. Under the doctrine of strict liability, owners of wild animals are held liable for any harm caused by those animals, regardless of whether the owner took reasonable precautions to prevent the escape or harm. In this case, the zebra's escape and subsequent injuries to the townspeople establish the farmer's strict liability. The first incorrect answer states that the farmer is not liable because he took reasonable steps to secure the zebra, which misapplies the strict liability rule; reasonable precautions do not negate liability for harm caused by wild animals. The second incorrect answer suggests liability depends on the zebra's known dangerousness, which is irrelevant since strict liability applies to wild animals regardless of their specific behavior. Lastly, the statement that the farmer is not liable because the injuries occurred off his property is also incorrect; strict liability applies irrespective of the location of the injury, particularly when a wild animal escapes and causes harm.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100391867,
      "generatedAt": 1755100331867
    }
  ],
  "Contracts": [
    {
      "qid": "fresh_openai_1755099867544_b2c1e123",
      "subject": "Contracts",
      "topic": "Offer/Acceptance",
      "stem": "Alice, a book publisher, sends a letter to Bob, an author, offering to publish his manuscript for a payment of $10,000. The letter states that Bob must accept the offer by March 1. On February 28, Bob mails a letter of acceptance to Alice. However, on the same day, he also sends a text message to Alice stating he has decided to decline the offer. Alice receives the text message before the acceptance letter. Which of the following statements is true regarding the contract between Alice and Bob?",
      "choices": [
        "A contract is formed because Bob mailed his acceptance before declining the offer.",
        "A contract is formed because acceptance is valid upon dispatch.",
        "No contract is formed because Bob's acceptance was not received by Alice before his rejection.",
        "No contract is formed because Bob's text message is a valid rejection of the offer."
      ],
      "correctIndex": 3,
      "explanation": "Bob's text message constitutes a valid rejection, preventing the formation of a contract.",
      "explanationLong": "The correct answer is that no contract is formed because Bob's text message is a valid rejection of the offer. Under the mailbox rule, an acceptance is generally effective upon dispatch; however, a rejection is effective only upon receipt. Here, Bob sent a text message rejecting the offer before Alice received the acceptance letter, which means that the rejection is valid and prevents the formation of a contract. Answer choice 0 is incorrect because although Bob mailed his acceptance, the subsequent rejection via text takes precedence upon receipt. Answer choice 2 is incorrect because while acceptance is valid upon dispatch, it does not apply when a rejection is communicated prior to the acceptance being received. Answer choice 3 is incorrect because, although Bob’s acceptance was mailed, it was not received by Alice before the rejection was communicated, thus no contract was formed.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099927544,
      "generatedAt": 1755099867544
    },
    {
      "qid": "fresh_openai_1755099867422_bad846dc",
      "subject": "Contracts",
      "topic": "Consideration",
      "stem": "Alice offers to sell her vintage guitar to Bob for $500. Bob, who has always wanted the guitar, agrees to purchase it. After a week, Alice changes her mind and decides not to sell. Bob insists that they have a binding agreement. Which of the following statements best describes the enforceability of their agreement?",
      "choices": [
        "The agreement is not enforceable because Bob's agreement lacked consideration.",
        "The agreement is enforceable because it was made in writing and signed by both parties.",
        "The agreement is enforceable because Bob's desire for the guitar constitutes sufficient consideration.",
        "The agreement is not enforceable because Alice did not receive any consideration from Bob."
      ],
      "correctIndex": 3,
      "explanation": "The correct answer is that the agreement is not enforceable because Alice did not receive any consideration from Bob.",
      "explanationLong": "The correct answer is that the agreement is not enforceable because Alice did not receive any consideration from Bob. In contract law, consideration requires a benefit to the promisor or a detriment to the promisee. Here, Bob's mere desire for the guitar does not constitute legal consideration since he has not provided anything of value in exchange for the guitar. Answer choice A is incorrect because a mere desire or wish does not qualify as consideration. Answer choice C is incorrect because the Statute of Frauds does not apply here since there is no signed writing; an oral agreement lacks enforceability without consideration. Answer choice D is also incorrect because Bob's agreement does not lack consideration per se; rather, there is simply no consideration exchanged between the parties. Therefore, without consideration, Alice's agreement to sell the guitar is not enforceable against her.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099927423,
      "generatedAt": 1755099867424
    },
    {
      "qid": "fresh_openai_1755099875792_ff678b2c",
      "subject": "Contracts",
      "topic": "Parol Evidence",
      "stem": "Alice and Bob entered into a written contract for the sale of a car, which included a clause stating that the written agreement constituted the entire agreement between the parties. After the contract was signed, Bob claimed that Alice had verbally agreed to include new tires as part of the sale. Alice refused to acknowledge this claim, citing the written contract. Which of the following is the most likely outcome regarding Bob's claim?",
      "choices": [
        "Bob's claim will be denied because he did not provide written evidence of the verbal agreement.",
        "Bob's claim will be denied because the written contract is integrated and excludes prior oral agreements.",
        "Bob's claim will be upheld because verbal agreements can always be introduced to supplement written contracts.",
        "Bob's claim will be upheld because the inclusion of new tires is a separate agreement."
      ],
      "correctIndex": 1,
      "explanation": "The correct answer is that Bob's claim will be denied because the written contract is integrated and excludes prior oral agreements.",
      "explanationLong": "The correct answer is that Bob's claim will be denied because the written contract is integrated and excludes prior oral agreements. Under the Parol Evidence Rule, when a written contract is intended to be a complete and final expression of the parties' agreement, as indicated by the integration clause, prior or contemporaneous oral statements cannot be introduced to contradict or modify the terms of the written agreement. In this case, the contract explicitly states that it represents the entire agreement, thus excluding Bob's claim about the verbal agreement regarding new tires. Answer choice B is incorrect because it misapplies the rule by suggesting that verbal agreements can always supplement written contracts, which is not true when an integration clause is present. Answer choice C is erroneous because it incorrectly assumes that a verbal agreement can be treated as a separate agreement, whereas it is actually subject to the Parol Evidence Rule. Finally, answer choice D is wrong because the lack of written evidence does not impact the validity of the Parol Evidence Rule; the rule itself precludes Bob from introducing the oral agreement regardless of its documentation.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099935792,
      "generatedAt": 1755099875792
    },
    {
      "qid": "fresh_openai_1755100172411_a3155add",
      "subject": "Contracts",
      "topic": "Parol Evidence",
      "stem": "A homeowner entered into a written contract with a contractor to renovate her kitchen. The contract specified that the total cost would be $15,000 and included a detailed description of the work to be done. After the contract was signed, the homeowner claimed that the contractor verbally promised to include additional work on the kitchen's plumbing for an extra $3,000. When the contractor refused to perform the additional work without a change order, the homeowner sought to introduce the verbal promise as evidence in a lawsuit. Which of the following is true concerning the homeowner's ability to introduce this evidence?",
      "choices": [
        "The homeowner cannot introduce the verbal promise because the contract is fully integrated.",
        "The homeowner can introduce the verbal promise because it clarifies the written contract.",
        "The homeowner cannot introduce the verbal promise because it contradicts the written terms.",
        "The homeowner can introduce the verbal promise because it constitutes a collateral agreement."
      ],
      "correctIndex": 0,
      "explanation": "The homeowner cannot introduce the verbal promise because the contract is fully integrated.",
      "explanationLong": "The correct answer is that the homeowner cannot introduce the verbal promise because the contract is fully integrated. Under the parol evidence rule, if a written contract is determined to be fully integrated, it precludes the introduction of prior or contemporaneous oral agreements that contradict or modify the written terms. Here, the written contract explicitly details the work to be done and the total cost, indicating that it is a complete agreement. The verbal promise regarding additional plumbing work is thus inadmissible as it serves to modify the contract's terms. The first answer is incorrect because the verbal promise does not merely clarify the contract; it adds a new term, which is not permissible under the parol evidence rule. The third answer fails because a collateral agreement must not contradict the main contract, and here the verbal promise does contradict the written terms. The fourth answer is also inaccurate; while it is true that the verbal promise contradicts the written contract, the primary issue is that the contract is fully integrated, which is the reason it cannot be admitted at all.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100232411,
      "generatedAt": 1755100172411
    },
    {
      "qid": "fresh_openai_1755100154026_18b33a9f",
      "subject": "Contracts",
      "topic": "Defenses",
      "stem": "Alice, a professional photographer, entered into a contract with Bob to provide photography services for his wedding. The contract stipulated that Alice would provide her services for a fee of $2,000, and the wedding was scheduled for June 15. Two weeks before the wedding, Bob learned that Alice had been diagnosed with a serious illness that would prevent her from fulfilling the contract. Bob attempted to find another photographer but was unable to secure one on such short notice. On June 10, Bob informed Alice that he would not be paying her the agreed fee. If Alice sues Bob for breach of contract, which of the following defenses is most likely to be successful for Bob?",
      "choices": [
        "Bob can argue that Alice's illness constitutes an impossibility of performance.",
        "Bob can claim that he was not aware of the contract's terms when he canceled.",
        "Bob can assert that Alice's illness was foreseeable and therefore she should have made alternative arrangements.",
        "Bob can argue that he was acting in good faith by seeking another photographer."
      ],
      "correctIndex": 0,
      "explanation": "Bob's defense of impossibility of performance is valid due to Alice's serious illness preventing her from fulfilling the contract.",
      "explanationLong": "The correct answer is that Bob can argue that Alice's illness constitutes an impossibility of performance. Under contract law, a party may be excused from performance if an unforeseen event renders performance impossible. Alice's illness qualifies as such an event, as it directly prevents her from providing the contracted services. The other options are incorrect: (1) Bob’s claim of ignorance regarding the contract terms is irrelevant; he is bound by the contract he signed. (2) The foreseeability of Alice's illness does not negate the impossibility defense; unforeseen events are typically what invoke this doctrine. (3) While Bob may have sought another photographer, his actions do not negate his obligation under the original contract until he properly terminates it; good faith does not excuse breach of contract. Thus, Bob’s strongest defense lies in the doctrine of impossibility due to Alice’s illness.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100214026,
      "generatedAt": 1755100154026
    },
    {
      "qid": "fresh_openai_1755100177252_a25935dd",
      "subject": "Contracts",
      "topic": "Offer/Acceptance",
      "stem": "Alice, a graphic designer, sends an email to Bob, a small business owner, offering to create a logo for Bob’s new restaurant for $500. Bob replies the next day, stating he is 'interested' but wants to negotiate the price. Later, Bob calls Alice and verbally agrees to pay $400 for the logo. Alice, however, had already accepted another job and informs Bob that she cannot work on his project. Which of the following statements is true regarding the formation of a contract between Alice and Bob?",
      "choices": [
        "Alice's initial email constituted a binding offer that Bob accepted when he expressed interest.",
        "Alice's acceptance of another job invalidated any potential contract with Bob.",
        "No contract was formed because Bob's response was a counteroffer.",
        "Alice and Bob formed a contract when Bob verbally agreed to pay $400 for the logo."
      ],
      "correctIndex": 2,
      "explanation": "The correct answer is that no contract was formed because Bob's response was a counteroffer, which rejected Alice's original offer.",
      "explanationLong": "The correct answer is that no contract was formed because Bob's response was a counteroffer, which rejected Alice's original offer. Under contract law, an offer can be revoked before acceptance, and a mere expression of interest does not constitute acceptance. Bob's statement that he wanted to negotiate the price effectively altered the terms of Alice's original offer, thus creating a counteroffer rather than an acceptance. Therefore, Alice’s original offer was not accepted, and no contract was formed. The first answer is incorrect because Bob's verbal agreement at $400 was a counteroffer, not an acceptance of Alice's initial offer. The third answer is incorrect because Alice's initial email was an offer, but it was not accepted; it was countered by Bob. The fourth answer misapplies the law as Alice's acceptance of another job does not invalidate a contract that was never formed due to the counteroffer.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100237252,
      "generatedAt": 1755100177252
    }
  ],
  "Crim": [
    {
      "qid": "fresh_openai_1755099866754_07b5b0a7",
      "subject": "Crim",
      "topic": "General",
      "stem": "During a heated argument, Alex, in a fit of rage, pushes Jamie, causing Jamie to fall and sustain a minor injury. Jamie had previously threatened Alex, stating that he would 'get him' if they ever crossed paths again. When the police arrived, Alex claimed he was acting in self-defense. Which of the following is true regarding Alex's potential criminal liability?",
      "choices": [
        "Alex's defense of self-defense is valid because Jamie had previously threatened him.",
        "Alex is liable for aggravated assault because he pushed Jamie with the intent to harm.",
        "Alex is not liable for any crime as he acted in self-defense.",
        "Alex may be liable for battery since he intentionally caused physical harm to Jamie."
      ],
      "correctIndex": 3,
      "explanation": "Alex may be liable for battery since he intentionally caused physical harm to Jamie by pushing him.",
      "explanationLong": "The correct answer is that Alex may be liable for battery since he intentionally caused physical harm to Jamie. Under the law, battery is defined as the intentional infliction of harmful or offensive contact with another person. In this case, Alex's act of pushing Jamie clearly constitutes such contact, resulting in injury. The self-defense claim is not valid here because self-defense requires an imminent threat of harm, which Jamie's prior threats do not constitute in the moment of the push. The first answer is incorrect because Alex's self-defense claim does not absolve him of liability for battery, as he did not face an immediate threat at the time he acted. The third answer is also incorrect because while past threats can be relevant to a self-defense claim, they do not justify the use of force unless there is an immediate threat of harm. Lastly, the fourth answer is incorrect because aggravated assault requires a higher degree of intent to cause serious bodily harm, which is not supported by the facts presented; Alex's push, while harmful, does not meet this threshold. Thus, the most accurate conclusion is that Alex may be liable for battery.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099926754,
      "generatedAt": 1755099866754
    },
    {
      "qid": "fresh_openai_1755099958741_55db5e79",
      "subject": "Crim",
      "topic": "General",
      "stem": "During a heated argument, Alex, frustrated with his neighbor's constant noise complaints, throws a rock at the neighbor's window, shattering it. Alex did not intend to hit the neighbor but wanted to express his anger. Which of the following is the most accurate assessment of Alex's legal culpability?",
      "choices": [
        "Alex is guilty of criminal mischief because he caused damage to the neighbor's property.",
        "Alex is guilty of assault because throwing a rock at someone constitutes an attempted battery.",
        "Alex is not guilty because he did not intend to hit the neighbor.",
        "Alex is not guilty because the rock did not hit the neighbor."
      ],
      "correctIndex": 0,
      "explanation": "Alex is guilty of criminal mischief as he intentionally caused damage to property, regardless of intent to harm a person.",
      "explanationLong": "The correct answer is that Alex is guilty of criminal mischief because he intentionally caused damage to his neighbor's property by throwing the rock. The legal rule for criminal mischief requires that a person intentionally damages another's property, which Alex did, regardless of whether he intended to hit the neighbor. The second choice is incorrect because the lack of intent to harm the neighbor does not negate the intent to damage property. The third choice is incorrect because while throwing a rock could constitute an attempted battery, Alex's actions are more appropriately classified as criminal mischief due to the damage caused to the property. Finally, the fourth choice is incorrect because Alex's guilt does not depend on whether the rock hit the neighbor; it is sufficient that he intended to damage the property, which he did when he threw the rock at the window.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100018741,
      "generatedAt": 1755099958742
    },
    {
      "qid": "fresh_openai_1755099865424_773e117e",
      "subject": "Crim",
      "topic": "General",
      "stem": "During a heated argument, Alex and Jordan confront each other in a public park. In a fit of rage, Alex shoves Jordan, causing him to stumble and fall, resulting in a minor injury. Alex then leaves the scene. Which of the following is the most accurate characterization of Alex's actions?",
      "choices": [
        "Alex committed simple assault by intentionally causing apprehension of harmful contact.",
        "Alex committed battery because he made physical contact with Jordan.",
        "Alex committed no crime as the shove was not intended to cause harm.",
        "Alex committed aggravated assault due to the injury caused."
      ],
      "correctIndex": 1,
      "explanation": "Alex committed battery because he made physical contact with Jordan, which constitutes the unlawful application of force.",
      "explanationLong": "The correct answer is that Alex committed battery because he made physical contact with Jordan. Battery is defined as the unlawful application of force to another person, which includes any physical contact that is harmful or offensive. In this case, Alex's shove constitutes such contact, regardless of whether he intended to cause injury. The first option is incorrect because aggravated assault typically involves a serious injury or the use of a weapon, which is not present here. The second option mischaracterizes the situation; while Alex's actions may have caused apprehension, the legal definition of simple assault does not apply here as there was actual contact. The third option is incorrect because it fails to recognize that the shove, despite not being intended to cause serious harm, still qualifies as battery due to the physical contact involved.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755099925424,
      "generatedAt": 1755099865424
    },
    {
      "qid": "fresh_openai_1755100171757_bba5c954",
      "subject": "Crim",
      "topic": "General",
      "stem": "During a heated argument, Tom threatens to kill Jerry while holding a baseball bat. Jerry, fearing for his life, runs away and calls the police. Tom, realizing the seriousness of his words, puts the bat down and does not follow Jerry. Later, Tom is arrested for making a threat. What charge is most likely to be upheld against Tom?",
      "choices": [
        "Terroristic threats",
        "Assault in the second degree",
        "Attempted murder",
        "No crime was committed"
      ],
      "correctIndex": 0,
      "explanation": "Tom's actions constitute a terroristic threat as he made a credible threat to Jerry's life, causing fear of imminent harm.",
      "explanationLong": "The correct answer is 'Terroristic threats.' Under most jurisdictions, a person commits a terroristic threat when they threaten to commit a violent act with the intent to terrorize another or to cause evacuation of a building. Tom's threats made Jerry fear for his life, thus satisfying the legal definition of a terroristic threat. 'Assault in the second degree' is incorrect because, while Tom threatened Jerry, he did not make physical contact or attempt to do so, which is required for assault. 'Attempted murder' is also incorrect; Tom did not take any substantial steps toward executing the threat of murder as he did not pursue Jerry or attempt to harm him. Finally, 'No crime was committed' is incorrect because Tom's verbal threat, coupled with his possession of the bat, constituted a criminal act under the terroristic threats statute, regardless of whether he followed through with any physical action.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100231758,
      "generatedAt": 1755100171758
    },
    {
      "qid": "fresh_openai_1755100166866_d768668d",
      "subject": "Crim",
      "topic": "General",
      "stem": "During a heated argument, Alex grabs a baseball bat and swings it at Jamie, missing but causing Jamie to fall back in fear. Jamie suffers a broken wrist while trying to escape the situation. Which of the following is the most accurate statement regarding Alex's potential criminal liability?",
      "choices": [
        "Alex did not commit any crime because Jamie's injury was accidental.",
        "Alex committed assault because he attempted to cause physical harm to Jamie.",
        "Alex did not commit assault since he did not make contact with Jamie.",
        "Alex committed battery because he intended to cause harmful contact."
      ],
      "correctIndex": 1,
      "explanation": "Alex committed assault as he attempted to cause physical harm to Jamie, which created a reasonable apprehension of imminent harm.",
      "explanationLong": "The correct answer is that Alex committed assault because he attempted to cause physical harm to Jamie, which created a reasonable apprehension of imminent harm. Under criminal law, assault is defined as an intentional act that creates a reasonable apprehension of imminent harmful or offensive contact. Here, Alex's act of swinging the bat at Jamie, even without contact, instilled fear and apprehension of harm. The first wrong answer, stating that Alex did not commit assault since he did not make contact, is incorrect because contact is not required for an assault claim; the focus is on the apprehension created. The third answer incorrectly identifies the act as battery; battery requires actual contact, which did not occur. Lastly, the fourth answer misapplies the law by suggesting that Jamie's injury being accidental negates liability; however, the injury resulted from a lawful act committed in an unlawful manner, establishing Alex's culpability. Therefore, the legal definitions and facts align with the conclusion that Alex is liable for assault.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100226866,
      "generatedAt": 1755100166867
    },
    {
      "qid": "fresh_openai_1755100165845_543be67b",
      "subject": "Crim",
      "topic": "General",
      "stem": "During a heated argument at a bar, Alex and Jamie exchanged insults. In a moment of anger, Alex pushed Jamie, causing Jamie to stumble and fall, resulting in a minor injury. If the prosecution charges Alex with assault, what is the most likely outcome?",
      "choices": [
        "Alex will not be convicted of assault because he acted in self-defense.",
        "Alex will not be convicted of assault because the injury was minor and unintentional.",
        "Alex will be convicted of assault because the push was a reckless act.",
        "Alex will be convicted of assault because he intentionally pushed Jamie."
      ],
      "correctIndex": 3,
      "explanation": "Alex will likely be convicted of assault because he intentionally pushed Jamie, which constitutes the requisite intent for the offense.",
      "explanationLong": "The correct answer is that Alex will be convicted of assault because he intentionally pushed Jamie. Under criminal law, assault can be established through an intentional act that causes apprehension of harmful or offensive contact. Here, Alex's intentional push constitutes such an act. The minor injury does not negate the assault charge, as the focus is on the intent to cause offensive contact rather than the extent of the injury. The second choice is incorrect because assault can occur without significant injury if there is intent. The third choice fails because, while reckless acts can constitute assault, the facts indicate that Alex's act was intentional, not merely reckless. The fourth option is incorrect because there is no indication that Jamie posed an immediate threat to Alex, which is a requirement for a valid self-defense claim. Thus, Alex's actions do not meet the criteria for self-defense.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100225845,
      "generatedAt": 1755100165845
    },
    {
      "qid": "fresh_openai_1755100322765_5187f659",
      "subject": "Crim",
      "topic": "General",
      "stem": "During a heated argument at a local bar, Tom and Jerry exchange insults. In a moment of rage, Tom punches Jerry in the face, causing significant injury. Tom is charged with assault. At trial, Tom claims he acted in self-defense, stating that he felt threatened by Jerry's aggressive posture. What is the likely outcome of Tom's self-defense claim?",
      "choices": [
        "Tom's self-defense claim will fail because he did not attempt to retreat.",
        "Tom's self-defense claim will succeed because he was justified in using force to protect himself.",
        "Tom's self-defense claim will succeed because he perceived a threat from Jerry.",
        "Tom's self-defense claim will fail because he initiated the confrontation."
      ],
      "correctIndex": 3,
      "explanation": "Tom's self-defense claim will fail because he initiated the confrontation.",
      "explanationLong": "The correct answer is that Tom's self-defense claim will fail because he initiated the confrontation. Under the law of self-defense, a person may use reasonable force to protect themselves from imminent harm; however, this right is typically not available to a person who provokes the attack. In this case, Tom initiated the confrontation by punching Jerry, which undermines his claim of self-defense. Answer choice A is incorrect because simply perceiving a threat does not justify the use of force if one is the aggressor. Answer choice C is incorrect for the same reason; justification for self-defense is negated when one initiates the combat. Finally, answer choice D is incorrect because the duty to retreat does not apply to all jurisdictions, and in any case, Tom's initiation of the conflict means he cannot claim self-defense regardless of whether he retreated or not.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100382765,
      "generatedAt": 1755100322765
    },
    {
      "qid": "fresh_openai_1755100322305_834e420d",
      "subject": "Crim",
      "topic": "General",
      "stem": "During a heated argument, Alex threatens to punch Jamie if Jamie does not leave the bar immediately. Jamie, feeling threatened, leaves and later reports the incident to the police. Alex is charged with assault. Which of the following is most likely to be a valid defense for Alex?",
      "choices": [
        "Alex did not intend to actually harm Jamie.",
        "Alex was acting in self-defense.",
        "Alex's threat was not credible enough to cause fear.",
        "Alex was provoked by Jamie's actions."
      ],
      "correctIndex": 0,
      "explanation": "The correct answer is that Alex did not intend to actually harm Jamie, which is a valid defense to assault.",
      "explanationLong": "The correct answer is that Alex did not intend to actually harm Jamie. Under criminal law, assault requires the intent to cause apprehension of harmful or offensive contact. If Alex did not have the requisite intent to harm, then the charge may not stand. The first answer is correct because intent is a critical element of assault, and without it, the prosecution may not prove its case. The second answer is incorrect because self-defense is not applicable here; Alex was the initial aggressor and was not responding to an imminent threat. The third answer is also incorrect; the credibility of the threat does not negate intent; rather, it speaks to whether a reasonable person would feel threatened. Finally, the fourth answer fails because provocation does not excuse the threat made by Alex; it may reduce culpability in some contexts but does not negate the assault charge itself.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100382305,
      "generatedAt": 1755100322305
    },
    {
      "qid": "fresh_openai_1755100324515_2303a8be",
      "subject": "Crim",
      "topic": "General",
      "stem": "During a heated argument, John threatens to kill his neighbor, Tom, while holding a baseball bat. Later, John swings the bat at Tom but misses. Tom, feeling threatened, calls the police. Which of the following statements is true regarding John's actions?",
      "choices": [
        "John committed assault because he attempted to strike Tom with the bat.",
        "John did not commit assault because he did not make contact with Tom.",
        "John did not commit assault because he was only expressing his anger verbally.",
        "John committed assault because his threat to kill Tom constituted an immediate threat of harm."
      ],
      "correctIndex": 0,
      "explanation": "John committed assault because he attempted to strike Tom with the bat, which constitutes an intentional act that creates a reasonable apprehension of imminent harm.",
      "explanationLong": "The correct answer is that John committed assault because he attempted to strike Tom with the bat. Under criminal law, assault is defined as an intentional act that creates a reasonable apprehension of imminent harmful or offensive contact. Here, John's action of swinging the bat at Tom, regardless of whether contact was made, indicates an intent to cause harm and creates a reasonable apprehension in Tom. The first answer is correct because the attempt to strike Tom qualifies as assault. The second answer is incorrect because assault does not require actual contact; an attempt or threat that causes apprehension is sufficient. The third answer misapplies the law by conflating threats with the act of assault; while threatening language can be assault, it must be coupled with actions that cause apprehension, as John did by swinging the bat. The fourth answer is incorrect because expressing anger verbally, without any accompanying action that causes apprehension, does not meet the legal definition of assault.",
      "timeLimit": 60000,
      "timeLimitSec": 60,
      "deadlineTs": 1755100384515,
      "generatedAt": 1755100324515
    }
  ]
}